[
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/fake-mas-windows-activation-domain-used-to-spread-powershell-malware/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "A typosquatted domain impersonating the Microsoft Activation Scripts (MAS) tool was used to distribute malicious PowerShell scripts that infect Windows systems with the 'Cosmali Loader'.\nBleepingComputer has found that multiple MAS users began reporting on Reddit [\n1\n,\n2\n] yesterday that they received pop-up warnings on their systems about a Cosmali Loader infection.\nYou have been infected by a malware called 'cosmali loader' because you mistyped 'get.activated.win' as 'get.activate[.]win' when activating Windows in PowerShell.\nThe malware's panel is insecure and everyone viewing it has access to your computer.\nReinstall Windows and don't make the same mistake next time.\nFor proof that your computer is infected, check Task Manager and look for weird PowerShell processes.\nBased on the reports, attackers have set up a look-alike domain, \"get.activate[.]win,\" which closely resembles the legitimate one listed in the\nofficial MAS activation instructions\n, \"get.activated.win.\"\nGiven that the difference between the two is a single character (\"d\"), the attackers bet on users mistyping the domain.\nWarning message\nSource:\nRussianPanda\nSecurity researcher RussianPanda discovered that the notifications are related to the open source Cosmali Loader malware, and could be related to similar\npop-up notifications spotted\nby GDATA malware analyst Karsten Hahn.\nRussianPanda told BleepingComputer that Cosmali Loader delivered cryptomining utilities and the XWorm remote access trojan (RAT).\nAlthough it is unclear who pushed the warning messages to users, it is likely that a well-intended researcher\ngained access\nto the malware control panel and used it to inform users of the compromise.\nMAS is an open-source collection of PowerShell scripts that automate the activation of Microsoft Windows and Microsoft Office using HWID activation, KMS emulation, and various bypasses (Ohook, TSforge).\nThe project is hosted on GitHub and is openly maintained. However, Microsoft sees it as a piracy tool that activates products without a purchased license using unauthorized methods that circumvent its licensing system.\nThe maintainers of the project also warned users of the campaign and urged them to check the commands they type before executing them.\nUsers are recommended to avoid executing remote code if they don't fully understand what it does, always test in a sandbox, and avoid retyping commands to minimize the risk of fetching dangerous payloads from typosquatted domains.\nUnofficial Windows activators have been repeatedly\nused for malware delivery\n, so users need to be aware of the risks and exercise caution when using such tools.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nMalicious NPM packages fetch infostealer for Windows, Linux, macOS\nMicrosoft rolls out hardware-accelerated BitLocker in Windows 11\nWebRAT malware spread via fake vulnerability exploits on GitHub\nNew MacSync malware dropper evades macOS Gatekeeper checks\nFrance arrests Latvian for installing malware on Italian ferry",
    "date_extraction": "2025-12-25T09:46:14.644305"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/mongodb-warns-admins-to-patch-severe-rce-flaw-immediately/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Sergiu Gatlan",
    "contenu": "MongoDB has warned IT admins to immediately patch a high-severity vulnerability that can be exploited in remote code execution (RCE) attacks targeting vulnerable servers.\nTracked as\nCVE-2025-14847\n, this security flaw affects multiple MongoDB and MongoDB Server versions and can be exploited by unauthenticated threat actors in low-complexity attacks that don't require user interaction.\nCVE-2025-14847 is due to an\nimproper handling of length parameter inconsistency\n, which can allow attackers to execute arbitrary code and potentially gain control of targeted devices.\nTo patch the security flaw and block potential attacks, admins are advised to immediately upgrade to MongoDB 8.2.3, 8.0.17, 7.0.28, 6.0.27, 5.0.32, or 4.4.30.\nThe vulnerability impacts the following MongoDB versions:\nMongoDB 8.2.0 through 8.2.3\nMongoDB 8.0.0 through 8.0.16\nMongoDB 7.0.0 through 7.0.26\nMongoDB 6.0.0 through 6.0.26\nMongoDB 5.0.0 through 5.0.31\nMongoDB 4.4.0 through 4.4.29\nAll MongoDB Server v4.2 versions\nAll MongoDB Server v4.0 versions\nAll MongoDB Server v3.6 versions\n\"An client-side exploit of the Server's zlib implementation can return uninitialized heap memory without authenticating to the server. We strongly recommend upgrading to a fixed version as soon as possible,\" MongoDB's security team\nsaid in a Friday advisory\n.\n\"We strongly suggest you upgrade immediately. If you cannot upgrade immediately, disable zlib compression on the MongoDB Server by starting mongod or mongos with a networkMessageCompressors or a net.compression.compressors option that explicitly omits zlib.\"\nThe U.S. Cybersecurity and Infrastructure Security Agency (CISA) added\nanother MongoDB RCE flaw\n(CVE-2019-10758) to its catalog of known exploited vulnerabilities four years ago, tagging it as actively exploited and ordering federal agencies to secure their systems, as mandated by\nBinding Operational Directive (BOD) 22-01\n.\nMongoDB is a popular non-relational database management system (DBMS) that, unlike relational databases such as PostgreSQL and MySQL, stores data in BSON (Binary JSON) documents instead of tables.\nThe database software is used by more than 62,500 customers worldwide, including dozens of Fortune 500 companies.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nWindows PowerShell now warns when running Invoke-WebRequest scripts\nOver 1,400 CrushFTP servers vulnerable to actively exploited bug\nCritical RCE flaw impacts over 115,000 WatchGuard firewalls\nNew critical WatchGuard Firebox firewall flaw exploited in attacks\nHPE warns of maximum severity RCE flaw in OneView software",
    "date_extraction": "2025-12-25T09:46:16.198380"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/fbi-seizes-domain-storing-bank-credentials-stolen-from-us-victims/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "The U.S. government has seized the 'web3adspanels.org' domain and the associated database used by cybercriminals to host bank login credentials stolen in account takeover attacks.\nCybercriminals collected the credentials in phishing campaigns targeting American citizens through fraudulent ads on Google and Bing search services that led to fake banking portals.\nThe confirmed financial loss from this activity is estimated at $14.6 million. However, the FBI has determined that the attempted losses through this scheme were around $28 million.\n\"To date, the FBI has identified at least 19 victims throughout the United States, including two companies in the Northern District of Georgia, whose bank accounts have been compromised through this account takeover scheme, resulting in attempted losses of approximately $28 million dollars and actual losses of approximately $14.6 million dollars,\" the\nDepartment of Justice says\n.\n\"The seized domain hosted a server that contained the stolen login credentials of thousands of victims, including the credentials of the victims mentioned above.\"\nDuring the investigation, the FBI uncovered that the seized domain was used to host a backend server that was active as recently as November.\nThe seizure was carried out with assistance from Estonian law enforcement and other international partners.\nThe domain now shows a law enforcement banner informing that it is under the control of authorities.\nSource: BleepingComputer.com\nAuthorities have not made any arrests but the investigation may reveal clues leading to the operators.\nSince January, the FBI’s Internet Crime Complaint Center has received more than 5,100 complaints related to bank account takeovers, with reported losses\nexceeding $262 million\n.\nOnline banking users are recommended to bookmark official banking portals instead of searching on Google or Bing, or use ad blockers that hide promoted results entirely.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nFive plead guilty to helping North Koreans infiltrate US firms\nNigeria arrests dev of Microsoft 365 'Raccoon0365' phishing platform\nUS seizes E-Note crypto exchange for laundering ransomware payments\nNew Spiderman phishing service targets dozens of European banks\nCyberattack knocks offline France's postal, banking services",
    "date_extraction": "2025-12-25T09:46:17.732129"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/microsoft-rolls-out-hardware-accelerated-bitlocker-in-windows-11/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "Microsoft is rolling out hardware-accelerated BitLocker in Windows 11 to address growing performance and security concerns by leveraging the capabilities of system-on-a-chip and CPU.\nBitLocker is the native full-disk encryption feature in Windows that protects data from being readable without proper authentication. During normal device boot, it relies on the Trusted Platform Module (TPM) to securely manage encryption keys and automatically unlock the drive.\nMicrosoft states that as non-volatile memory express (NVMe) storage has become more performant, BitLocker's cryptographic operations have a more noticeable performance impact for gaming and video editing activities.\nWith hardware acceleration, bulk cryptographic operations can be offloaded to system-on-a-chip (SoC) components equipped with hardware security modules (HSMs) and trusted execution environments (TEEs), significantly improving cryptographic performance. This will naturally reduce CPU usage and improve overall system performance.\n\"When enabling BitLocker, supported devices with NVMe drives along with one of the new crypto offload capable SoCs will use hardware-accelerated BitLocker with the XTS-AES-256 algorithm by default,\"\nMicrosoft explains\n.\n\"This includes automatic device encryption, manual BitLocker enablement, policy driven enablement, or script-based enablement with some exceptions.\"\nIn actual tests, hardware-accelerated BitLocker had around 70% fewer CPU cycles per I/O compared to software-powered BitLocker, although results vary per hardware.\nIn addition to performance gains, BitLocker now utilizes hardware-protected keys, minimizing their exposure to CPU and memory cyberattacks and enhancing overall security alongside Trusted Platform Module (TPM)–based key protection.\nMicrosoft says this puts the mechanism on the path to eliminating BitLocker keys from the CPU and memory.\nSource: Microsoft\nThe new BitLocker is available starting with Windows 11 24H2, if September updates are installed, and on Windows 11 25H2.\nInitial support will arrive with Intel vPro systems using Intel Core Ultra Series 3 (“Panther Lake”) processors, but other SoC vendors will be added progressively.\nUsers can verify their BitLocker mode by running the command\nmanage-bde -status\nand checking for 'Hardware accelerated' info under Encryption Method.\nMicrosoft notes that BitLocker defaults on software-based mode if unsupported algorithms are used, key sizes are manually specified, enterprise policies dictate unsupported key size or algorithm, and when FIPS mode is enabled and the SoC does not report FIPS-certified crypto offload and key-wrapping capabilities.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nNew Windows RasMan zero-day flaw gets free, unofficial patches\nMicrosoft fixes Windows Explorer white flashes in dark mode\nWindows 11 KB5072033 & KB5071417 cumulative updates released\nMicrosoft: Windows 11 bug crashes Explorer and Start Menu\nMicrosoft: KB5070311 triggers File Explorer white flash in dark mode",
    "date_extraction": "2025-12-25T09:46:19.272149"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/webrat-malware-spread-via-fake-vulnerability-exploits-on-github/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "The WebRAT malware is now being distributed through GitHub repositories that claim to host proof-of-concept exploits for recently disclosed vulnerabilities.\nPreviously spread through pirated software and cheats for games like Roblox, Counter Strike, and Rust, WebRAT is a backdoor with info-stealing capabilities that emerged at the beginning of the year.\nAccording to a\nreport\nfrom Solar 4RAYS in May, WebRAT can steal credentials for Steam, Discord, and Telegram accounts, as well as cryptocurrency wallet data. It can also spy on victims through webcams and capture screenshots.\nSince at least September, the operators started to deliver the malware through carefully crafted repositories claiming to provide an exploit for several vulnerabilities that had been covered in media reports. Among them were:\nCVE-2025-59295\n– A heap-based buffer overflow in the Windows MSHTML/Internet Explorer component, enabling arbitrary code execution via specially crafted data sent over the network.\nCVE-2025-10294\n– A critical authentication bypass in the OwnID Passwordless Login plugin for WordPress. Due to improper validation of a shared secret, unauthenticated attackers could log in as arbitrary users, including administrators, without credentials.\nCVE-2025-59230\n– An\nelevation-of-privilege (EoP) vulnerability\nin Windows’ Remote Access Connection Manager (RasMan) service. A locally authenticated attacker could exploit improper access control to escalate their privileges to SYSTEM level on affected Windows installations.\nSecurity researchers at Kaspersky discovered 15 repositories distributing WebRAT, all of them providing information about the issue, what the alleged exploit does, and the available mitigations.\nDue to the way the information is structured, Kaspersky believes that the text was generated using an artificial intelligence model.\nBug descriptions in the malicious repositories\nSource: Kaspersky\nThe malware has multiple methods to establish persistence, including Windows Registry modifications, the Task Scheduler, and injecting itself into random system directories.\nKaspersky researchers say that the fake exploits are delivered in the form of a password-protected ZIP file containing an empty file with the password as its name, a corrupted decoy DLL file acting as a decoy, a batch file used in the execution chain, and the main dropper named\nrasmanesc.exe\n.\nThe archive's contents\nSource: Kaspersky\nAccording to the analysts, the dropper elevates privileges, disables Windows Defender, and then downloads and executes WebRAT from a hardcoded URL.\nKaspersky\nnotes\nthat the WebRAT variant used in this campaign is no different from previously documented samples and lists the same capabilities described in past reports.\nWebRAT's operational overview\nSource: Kaspersky\nUsing fake exploits on GitHub to lure unsuspecting users into installing malware is not a new tactic, as it has been extensively documented in the past [\n1\n,\n2\n,\n3\n,\n4\n]. More recently, threat actors promoted a\nfake “LDAPNightmare” exploit\non GitHub to spread infostealing malware.\nAll malicious GitHub repositories related to the WebRAT campaign that Kaspersky uncovered have been removed. However, developers and infosec enthusiasts should be careful about the sources they use, as threat actors can submit new lures under different publisher names.\nThe general rule when testing exploits or code that comes from a potentially untrusted source is to run them in a controlled, isolated environment.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nW3 Total Cache WordPress plugin vulnerable to PHP command injection\nFortinet FortiWeb flaw with public PoC exploited to create admin users\nHackers steal Discord accounts with RedTiger-based infostealer\nFake MAS Windows activation domain used to spread PowerShell malware\nNissan says thousands of customers exposed in Red Hat breach",
    "date_extraction": "2025-12-25T09:46:20.887216"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/malicious-extensions-in-chrome-web-store-steal-user-credentials/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "Two Chrome extensions in the Web Store named 'Phantom Shuttle' are posing as plugins for a proxy service to hijack user traffic and steal sensitive data.\nBoth extensions are still present in Chrome's official marketplace at the time of writing and have been active since at least 2017, according to a report from researchers at the Socket supply-chain security platform.\nPhantom Shuttle’s target audience is users in China, including foreign trade workers who need to test connectivity from various locations in the country.\nBoth extensions are published under the same developer name and are promoted as tools that can proxy traffic and test network speed. They are available for a subscription between $1.4 - $13.6.\nThe Phantom Shuttle extension on the Web Store\nSource: BleepingComputer\nCovert data-theft functionality\nSocket.dev\nresearchers say\nthat Phantom Shuttle routes all user web traffic through proxies controlled by the threat actor, accessible via hardcoded credentials. The code doing this is prepended to the legitimate jQuery library.\nThe malicious code hides the hardcoded proxy credentials using a custom character-index encoding scheme. Through a web traffic listener, the extensions can intercept HTTP authentication challenges on every website.\nTo automatically run user traffic through the attacker's proxies, the malicious extensions dynamically reconfigure Chrome’s proxy settings using an auto-configuration script.\nIn the default “smarty” mode, it routes more than 170 high-value domains through the proxy network, including developer platforms, cloud service consoles, social media sites, and adult content portals.\nOn the exclusion list are local networks and the command-and-control domain, to avoid disruption and detection.\nWhile acting as a man-in-the-middle, the extension can capture data from any form (credentials, card details, passwords, personal info), steal session cookies from HTTP headers, and extract API tokens from requests.\nBleepingComputer has contacted Google about the extensions still being present in the Web Store, but a comment wasn't immediately available.\nChrome users are advised to trust only extensions from reputable publishers, check multiple user reviews, and pay attention to the permissions requested upon installation.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nBaker University says 2024 data breach impacts 53,000 people\nUniversity of Phoenix data breach impacts nearly 3.5 million individuals\nUniversity of Phoenix discloses data breach after Oracle hack\nMalicious npm package steals WhatsApp accounts and messages\nClop ransomware targets Gladinet CentreStack in data theft attacks",
    "date_extraction": "2025-12-25T09:46:22.434458"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/cyberattack-knocks-offline-frances-postal-banking-services/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Sergiu Gatlan",
    "contenu": "La Poste, the French national postal service, confirmed on Monday that all its information systems were knocked offline by \"a major network incident,\" disrupting digital banking and online services for millions of customers.\nOn social media, La Poste announced that the disruption rendered multiple platforms temporarily inaccessible, including its main website, mobile app, digital identity service, and the Digiposte document storage platform.\nSome post office locations experienced service disruptions, though officials said customers could still conduct banking and postal transactions at service counters.\n\"For banking customers, online payments remain possible with SMS authentication. Cash withdrawals from ATMs, card payments at in-store POS terminals, and transfers via WERO are still available,\"\nLa Poste said\n.\n\"In some post offices, service may be temporarily disrupted. However, it is still possible to carry out your banking and postal transactions at the counter.\"\nLa Poste's website was still down when this article was published, redirecting customers to its webmail and Digiposte platforms.\nLa Poste website offline (BleepingComputer)\n​La Banque Postale, the banking arm of Groupe La Poste, confirmed that its online and mobile services were also down, but said core banking operations remained functional.\n\"The bank's essential services are not impacted. Payments, interbank exchanges and flow processing are operating normally. Cash withdrawals from ATMs, in-store credit card payments and transfers via WERO remain accessible,\"\nit said\n.\n\"Online, internet and mobile card payments remain possible with SMS authentication to replace certification via Certicode.\"\nWhile the postal service has yet to provide a timeline for\nfull service restoration or disclose the nature of the incident,\nFrench news outlets\nreported that\nthe outage was caused by a distributed denial-of-service (DDoS) attack that disrupted the company's operations nationwide.\nLa Poste is a public-owned company with over 250,000 employees part of the Groupe La Poste, which handles everything from package shipping and mail delivery to banking, insurance, and mobile telecommunications services.\nThis comes after French authorities\narrested a 22-year-old suspect\nlast week in connection with a cyberattack on the email servers of\nFrance's Ministry of the Interior\nearlier this month.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nFrench Interior Ministry confirms cyberattack on email servers\nFrench Football Federation discloses data breach after cyberattack\nFBI seizes domain storing bank credentials stolen from U.S. victims\nDenmark blames Russia for destructive cyberattack on water utility\nFrance arrests Latvian for installing malware on Italian ferry",
    "date_extraction": "2025-12-25T09:46:24.007273"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/italy-fines-apple-116-million-over-app-store-tracking-privacy-practices/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Sergiu Gatlan",
    "contenu": "Italy's competition authority (AGCM) has fined Apple €98.6 million ($116 million) for using the App Tracking Transparency (ATT) privacy framework to abuse its dominant market position in mobile app advertising.\nATT\nrequires developers to request consent to collect their data for targeted advertising before tracking them across websites, apps, and services owned by other companies. Apple introduced ATT in June 2020 and began enforcing it in April 2021 with the release of iOS 14.5 and iPadOS 14.5.\nAs the AGCM\nsaid in a Monday press release\nfollowing a two-year investigation, Apple's ATT policy requires third-party apps to display a standardized prompt requesting user permission to track activity across other companies' apps and websites.\nHowever, Apple's own apps and services are exempt from showing the prompt. The AGCM said ATT's implementation forces developers to request consent twice for the same purpose.\nBecause the ATT prompt doesn't satisfy EU privacy law requirements under GDPR, developers must also display their own consent mechanism, creating what regulators called an \"excessively burdensome\" double-consent process.\n\"In other words, while fully supporting the objective of ensuring that users’ consent is full, free and informed, the Authority found that – also on the basis of the opinion of the Data Protection Authority – Apple could have achieved the same level of privacy protection for its users through means less restrictive of competition,\"\nthe Italian antitrust agency explained\n.\n\"This would have prevented the unilateral imposition of additional burdens on third-party developers, thereby avoiding the above-mentioned double consent requests for advertising purposes.\"\nIn reaction to AGCM's decision, Apple told BleepingComputer that it will appeal and will continue \"to defend strong privacy protections.\"\n\"At Apple, we believe privacy is a fundamental human right, and we created App Tracking Transparency to give users a simple way to control whether companies can track their activity across other apps and websites. These rules apply equally to all developers, including Apple, and have been embraced by our customers and praised by privacy advocates and data protection authorities around the world, including the Garante,\" Apple told BleepingComputer.\n\"We strongly disagree with the ICA’s decision, which disregards the important privacy protections ATT provides in favor of ad tech companies and data brokers who want unfettered access to users’ personal data. We will continue to defend strong privacy protections for our users as we appeal.\"\nIn April,\nApple was also fined €150 million\n($162 million) by France's antitrust watchdog for using the ATT privacy framework to abuse its dominant market position in mobile app advertising.\nSimilar investigations are ongoing in\nPoland\n, and Apple also moved to change the ATT consent prompt\nat the German regulator's request\nin early December to address antitrust concerns.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nNew MacSync malware dropper evades macOS Gatekeeper checks\nApple fixes two zero-day flaws exploited in 'sophisticated' attacks\nUK fines LastPass over 2022 data breach impacting 1.6 million users\nEU fines X $140 million over deceptive blue checkmarks\nRussia blocks FaceTime and Snapchat for alleged use by terrorists",
    "date_extraction": "2025-12-25T09:46:25.758862"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/baker-university-data-breach-impacts-over-53-000-individuals/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Sergiu Gatlan",
    "contenu": "Baker University has disclosed a data breach after attackers gained access to its network one year ago and stole the personal, health, and financial information of over 53,000 individuals.\nFounded in 1858, Baker University is a private university in Baldwin City, Kansas, with\nnearly 2,000 enrolled students\n(1,457 undergraduates) and over 300 employees.\nThe school detected suspicious activity on its network after a December 2024 outage and found that attackers had access to its systems from December 2 to 19, stealing sensitive documents.\n\"Through this review, Baker University determined that information which may have been involved included data related to those affiliated with Baker University,\"\nit said\nin a breach notification letter shared on the school's website.\n\"Although the information varied by individual, the information includes name, date of birth, Driver's license number, financial account information, health insurance information, medical information, passport information, Social Security number, student identification number, and tax identification number.\"\nIn a\nfiling with the Office of the Maine Attorney General\n, Baker University revealed that the resulting data breach impacts 53,624 individuals.\nWhile the school said it found no evidence that the information was used for fraudulent activities, it is now offering free credit monitoring services to those affected and encourages potentially affected individuals to regularly check their account statements and credit reports for suspicious activity.\n\"The confidentiality, privacy, and security of our Baker community's personal information is one of our university's highest priorities,\" said Baker University president Jody Fournier. \"Our team has been working alongside an external team of experts at a cyber security firm since the incident and has rebuilt one of our primary platforms that was compromised during the cyber incident.\"\nThe university has yet to share the nature of the attack and attribute the incident to a specific cybercrime operation or state-backed threat group.\nSeveral other U.S. universities have also been breached in\nvoice phishing attacks\nsince late October, with\nHarvard University\n,\nPrinceton University\n, and\nthe University of Pennsylvania\ndisclosing that their development and alumni activities systems were hacked to steal the personal information of students, alumni, donors, and staff.\nThe Clop ransomware gang also breached\nHarvard University\nand the\nUniversity of Pennsylvania\nin a data theft campaign that exploited a zero-day vulnerability in their Oracle E-Business Suite (EBS) financial platforms to steal sensitive personal and financial data belonging to students, staff, and suppliers.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nUniversity of Phoenix discloses data breach after Oracle hack\nUniversity of Phoenix data breach impacts nearly 3.5 million individuals\nUniversity of Pennsylvania confirms new data breach after Oracle hack\nComcast to pay $1.5M fine for vendor breach affecting 270K customers\nHarvard University discloses data breach affecting alumni, donors",
    "date_extraction": "2025-12-25T09:46:27.333686"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/nissan-says-thousands-of-customers-exposed-in-red-hat-breach/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "Nissan Motor Co. Ltd. (Nissan) has confirmed that information of thousands of its customers has been compromised after the data breach at Red Hat in September.\nThe Japanese multinational automobile manufacturer headquartered in Yokohama, Japan, produces more than 3.2 million cars a year. The company employs 120,000 people and has a strong presence in Japan, North America, Europe, and Asia.\nIn an announcement yesterday, Nissan informed that it was indirectly impacted by a security breach incident at the U.S.-based enterprise software company Red Hat.\n\"Nissan Motor Co., Ltd. received a report from Red Hat, the company it commissioned to develop customer management systems for its sales companies, that unauthorized access to its data servers had resulted in the data being leaked,\" the Japanese company\nsays\n.\n\"It was later confirmed that the data leaked by the company contained some customer information from Nissan Fukuoka Sales Co., Ltd.\"\nSpecifically, approximately 21,000 customers who purchased vehicles or received services at Nissan in Fukuoka, Japan, had the following information leaked:\nFull names\nPhysical addresses\nPhone numbers\nEmail addresses\nCustomer data used in sales operations\nThe Japanese automaker noted that financial information such as credit card details was not exposed.\nA Crimson Collective hack\nThe Red Hat breach disclosed in early October involved the theft of hundreds of gigabytes of sensitive data from\n28,000 private GitLab repositories\n, initially claimed by the Crimson Collective threat actor.\nLater,\nShinyHunters became involved\nby hosting samples of the stolen data on their extortion platform, directly applying pressure to the victimized firm.\nNissan noted that the compromised Red Hat environment does not store any other data beyond what was confirmed as impacted, and underlines that it has no evidence that the leaked information has been misused.\nBleepingComputer has contacted Nissan Japan, Nissan Europe, and Nissan Americas for additional comment on the Re Hat incident impacting operations, but we have not received a reply as of publication.\nThis is the second cybersecurity incident for Nissan Japan this year, following a\nQilin ransomware attack\nin late August that hit its design subsidiary Creative Box Inc. (CBI).\nLast year, Nissan North America suffered a data breach that impacted\n53,000 employees\n, while Nissan Oceania announced that an Akira ransomware attack had exposed the data of\n100,000 customers\n.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nAskul confirms theft of 740k customer records in ransomware attack\n700Credit data breach impacts 5.8 million vehicle dealership customers\nComcast to pay $1.5M fine for vendor breach affecting 270K customers\nDartmouth College confirms data breach after Clop extortion attack\nIberia discloses customer data leak after vendor security breach",
    "date_extraction": "2025-12-25T09:46:28.877154"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/new-macsync-malware-dropper-evades-macos-gatekeeper-checks/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "The latest variant of the MacSync information stealer targeting macOS systems is delivered through a digitally signed, notarized Swift application.\nSecurity researchers at Apple device management platform Jamf say that the distribution method constitutes a significant evolution from past iterations that used less sophisticated \"drag-to-Terminal\" or ClickFix tactics.\n\"Delivered as a code-signed and notarized Swift application within a disk image named zk-call-messenger-installer-3.9.2-lts.dmg, distributed via https://zkcall.net/download, it removes the need for any direct terminal interaction,\" the researchers say in a report today.\nValid digital signature and notarization\nSource: Jamf\nAt the time of the analysis, Jamf says that the latest MacSync variant had a valid signature and could bypass checks from Gatekeeper, the security system in macOS.\n\"After inspecting the Mach-O binary, which is a universal build, we confirmed that it is both code-signed and notarized. The signature is associated with the Developer Team ID GNJLS3UYZ4,\" Jamf\nexplains\n.\nHowever, following a direct report of the certificate to Apple, it has now been revoked.\nThe malware is delivered on the system through a dropper in encoded form. After decoding the payload, researchers discovered the usual signs of the MacSync Stealer.\nThe deobfuscated payload\nSource: Jamf\nThe researchers noted that the stealer features several evasion mechanisms, including inflating the DMG file to 25.5MB by embedding decoy PDFs, wiping the scripts used in the execution chain, and performing internet connectivity checks before execution to evade sandboxed environments.\nThe inflated disk image contents\nSource: Jamf\nThe stealer emerged in April 2025 as Mac.C by a threat actor named ‘Mentalpositive’. It\ngained traction\nby July, joining the less crowded but still profitable space of macOS stealers alongside\nAMOS\nand\nOdyssey\n.\nA previous\nanalysis of Mac.C by MacPaw Moonlock\nindicates that it can steal iCloud keychain credentials, passwords stored on web browsers, system metadata, cryptocurrency wallet data, and files from the filesystem.\nInterestingly, in\nan interview\nthat Mentalpositive gave to researcher g0njxa in September, the malware author stated that the introduction of a tighter app notarization policy in macOS 10.14.5 and later had the strongest influence on their development plans, which is reflected in the latest versions caught in the wild.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nGoogle ads for shared ChatGPT, Grok guides push macOS infostealer malware\nAtomic macOS infostealer adds backdoor for persistent attacks\nMalicious VSCode extensions on Microsoft's registry drop infostealers\nPolice disrupts Rhadamanthys, VenomRAT, and Elysium malware operations\nDanaBot malware is back to infecting Windows after 6-month break",
    "date_extraction": "2025-12-25T09:46:30.618735"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/interpol-led-action-decrypts-6-ransomware-strains-arrests-hundreds/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "An Interpol-coordinated initiative called Operation Sentinel led to the arrest of 574 individuals and the recovery of $3 million linked to business email compromise, extortion, and ransomware incidents.\nBetween October 27 and November 27, the investigation, which involved law enforcement in 19 countries, took down more than 6,000 malicious links and decrypted six distinct ransomware variants.\nInterpol says that the cybercrime cases investigated are connected to more than $21 million in financial losses.\nThe international police agency highlights the following successes during the recent Operation Sentinel:\nSenegal:\nAuthorities stopped a $7.9 million BEC wire transfer targeting a petroleum company by freezing accounts before funds were withdrawn\nGhana:\nA financial institution lost $120,000 and suffered encryption of 100 TB of data in a ransomware attack. Law enforcement analyzed the malware, developed a decryption tool, and recovered 30 TB; multiple arrests followed\nGhana/Nigeria:\nA cross-border scam mimicking well-known fast-food brands defrauded 200+ victims of over $400,000. The action resulted in ten suspects arrested, over 100 devices seized, and 30 servers taken offline\nBenin:\n106 arrests, 43 malicious domains removed, and 4,318 scam-linked social media accounts shut down\nCameroon:\nRapid response to an online vehicle sales scam led to tracing a compromised server and issuing an emergency bank freeze within hours\nArrests of cybercriminals in Ghana\nSource: INTERPOL\n\"The scale and sophistication of cyberattacks across Africa are accelerating, especially against critical sectors like finance and energy,\"\nsaid Neal Jetton\n, Director of Cybercrime at Interpol.\n\"The outcomes from Operation Sentinel reflect the commitment of African law enforcement agencies, working in close coordination with international partners.\"\nPartners from the private sector who aided in the investigations include Team Cymru, The Shadowserver Foundation, Trend Micro, TRM Labs, and Uppsala Security. The companies helped trace IP addresses used in ransomware and sextortion attacks, and also in freezing cybercrime proceeds.\nIn August, Interpol coordinated another Africa-focused operation, codenamed ‘\nSerengeti 2.0\n,’ that resulted in the arrest of 1,209 suspects of cybercrime. Authorities recovered $97.4 million of illicit funds and dismantled 11,432 malicious infrastructures linked to attacks on 87,858 victims.\nIn March, another Interpol-led international crackdown named ‘\nOperation Red Card\n’ apprehended 306 suspects, seized 1,842 devices, and disrupted scams that victimized over 5,000 people.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nNigeria arrests dev of Microsoft 365 'Raccoon0365' phishing platform\nUS seizes E-Note crypto exchange for laundering ransomware payments\nKorea arrests suspects selling intimate videos from hacked IP cameras\nMalicious LLMs empower inexperienced hackers with advanced tools\nRussian bulletproof hosting provider sanctioned over ransomware ties",
    "date_extraction": "2025-12-25T09:46:32.244042"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/malicious-npm-package-steals-whatsapp-accounts-and-messages/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "A malicious package in the Node Package Manager (NPM) registry poses as a legitimate WhatsApp Web API library to steal WhatsApp messages, collect contacts, and gain access to the account.\nA fork of the popular WhiskeySockets Baileys project, the malicious package provides the legitimate functionality. It has been available on npm published under the name\nlotusbail\nfor at least six months and has accumulated more than 56,000 downloads.\nThe\nThe lotusbail package on NPM\nSource: BleepingComputer\nResearchers at supply-chain security company Koi Security discovered the malicious package and found that it could steal WhatsApp authentication tokens and session keys, intercept and record all messages - both sent and received, and exfiltrate contact lists, media files, and documents.\n\"The package wraps the legitimate WebSocket client that communicates with WhatsApp. Every message that flows through your application passes through the malware's socket wrapper first,\" the researchers\nexplain\n.\n\"When you authenticate, the wrapper captures your credentials. When messages arrive, it intercepts them. When you send messages, it records them.\"\nCode to capture data\nSource: Koi Security\nThe captured information is encrypted with a custom RSA implementation and multiple layers of obfuscation, such as Unicode tricks, LZString compression, and AES encryption before exfiltration.\nApart from the data theft activity, the malicious package also features code that links the attacker's device to the victim's WhatsApp account through the device pairing process.\nThis grants the attacker persistent access to the account even after the malicious NPM package has been removed. Access remains until the victim manually removes the linked devices from WhatsApp settings.\nThe device pairing function\nSource: Koi Security\nKoi Security reports that\nlotusbail\nuses a set of 27 infinite loop traps to make debugging and analysis harder, which is likely how it has managed to fly under the radar for so long.\nDevelopers who used the package are recommended to remove it from the system and check their WhatsApp account for rogue linked devices.\nKoi Security emphasizes that looking at source code to find the malicious lines isn't enough; developers should monitor runtime behavior for unexpected outbound connections or activity during authentication flows with new dependencies to validate their safety.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nPhantomRaven attack floods npm with credential-stealing packages\nMalicious VSCode Marketplace extensions hid trojan in fake PNG file\nShai-Hulud 2.0 NPM malware attack exposed up to 400,000 dev secrets\nShai-Hulud malware infects 500 npm packages, leaks secrets on GitHub\nWhatsApp API flaw let researchers scrape 3.5 billion accounts",
    "date_extraction": "2025-12-25T09:46:33.805153"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/romanian-water-authority-hit-by-ransomware-attack-over-weekend/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Sergiu Gatlan",
    "contenu": "Romanian Waters (Administrația Națională Apele Române), the country's water management authority, was hit by a ransomware attack over the weekend.\nOfficials with the National Cyber Security Directorate (DNSC)\nsaid Sunday\nthat the incident impacted approximately 1,000 computer systems at the national water authority and 10 of its 11 regional offices.\nWhile the breach affected servers running geographic information systems, databases, email, and web services, as well as Windows workstations and domain name servers, operations and operational technology (OT) systems controlling water infrastructure are unaffected.\nInvestigators from multiple Romanian security agencies, including the Romanian Intelligence Service's National Cyberint Center, who are now investigating the incident and working to contain its impact, have found that the attackers used the built-in Windows BitLocker security feature to lock files on compromised systems, then left a ransom note demanding that they be contacted within 7 days.\n\"The National Administration 'Romanian Waters' specifies that the coordination of operations related to hydrotechnical assets is conducted dispatch centres by using voice communication channels. Hydrotechnical facilities are safe and they are locally operated by on-site personnel coordinated via the dispatch centres,\" the agency\nsaid\n.\nThe Romanian cybersecurity agency stated that while the country's national cybersecurity system for critical IT infrastructure did not protect the water management authority's infrastructure before the attack, authorities are now working to integrate it into protective systems operated by the National Cyberint Center.\nInvestigation ongoing, no attribution\nIn an update on Sunday, officials said the attack vector has not yet been identified and that the national water authority's operations remain unaffected by the incident.\n\"Dispatching and operation of hydrotechnical structures are carried out within normal parameters, using telephone and radio communications. Hydrotechnical structures are safe and are operated locally by service personnel, coordinated by dispatchers. Forecasting and flood protection activities have not been affected,\" the DNSC added in a Monday update.\nWhile no ransomware operation or state-backed threat group has claimed responsibility to date, and the Romanian Waters agency has yet to attribute the attack, the incident follows\nDanish intelligence officials' blaming Russia\nfor orchestrating a destructive water-utility cyberattack in 2024.\nIn early December, together with the FBI, NSA, European Cybercrime Centre (EC3), and various other cybersecurity and law enforcement agencies worldwide,\nCISA warned\nthat pro-Russia hacktivist groups, including Z-Pentest, Sector16, NoName, and CARR (Cyber Army of Russia Reborn), are targeting critical infrastructure organizations worldwide.\nThis is the latest major ransomware attack that has hit Romania in recent years.\nElectrica Group\n(a major Romanian electricity supplier and distributor) was also\nbreached by the Lynx ransomware gang\none year ago, while over 100 hospitals across Romania were forced to\ntake their systems offline\nafter a February 2024 Backmydata ransomware attack disrupted their healthcare management systems.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nLynx ransomware behind Electrica energy supplier cyberattack\nYanluowang initial access broker pleaded guilty to ransomware attacks\nBaker University says 2024 data breach impacts 53,000 people\nUniversity of Phoenix data breach impacts nearly 3.5 million individuals\nInterpol-led action decrypts 6 ransomware strains, arrests hundreds",
    "date_extraction": "2025-12-25T09:46:35.430096"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/university-of-phoenix-data-breach-impacts-nearly-35-million-individuals/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Sergiu Gatlan",
    "contenu": "The Clop ransomware gang has stolen the data of nearly 3.5 million University of Phoenix (UoPX) students, staff, and suppliers after breaching the university's network in August.\nHeadquartered in Phoenix, Arizona, UoPX is a private for-profit university founded in 1976 with\n82,700 enrolled students\nand 3,400 employees (nearly 2,300 academic staff).\nIn early December, the university\ndisclosed the incident\non its official website, and Phoenix Education Partners, its parent company, filed an 8-K with the U.S. Securities and Exchange Commission (SEC).\nUoPX said it detected the breach on November 21 (after Clop added it to its data leak site), noting that the attackers exploited a zero-day vulnerability in the Oracle E-Business Suite (EBS) financial application to steal sensitive personal and financial information belonging to staff, suppliers, and current and former students.\n\"We believe that the unauthorized third-party obtained certain personal information, including names and contact information, dates of birth, social security numbers, and bank account and routing numbers with respect to numerous current and former students, employees, faculty and suppliers was accessed without authorization,\" the school stated.\nAndrea Smiley, the university's Vice President for Public Relations, told BleepingComputer at the time that UoPX was \"reviewing the impacted data and will provide the required notifications to affected individuals and regulatory entities.\"\nOn Monday, the school revealed in notification letters\nfiled\nwith the office of Maine's Attorney General and mailed to those whose data were stolen in the attack that the data breach affects 3,489,274 individuals.\nUoPX now offers free identity protection services, including a $1 million fraud reimbursement policy, 12 months of credit monitoring, identity theft recovery, and dark web monitoring.\nUniversity of Phoenix entry on Clop's leak site (BleepingComputer)\n​While the school has yet to attribute the breach, based on the details shared so far, the attack is part of a Clop extortion campaign in which the ransomware gang\nexploited a zero-day flaw (CVE-2025-61882)\nsince\nearly August 2025\nto steal data from many victims' Oracle EBS platforms.\nClop has also targeted other U.S. universities in the same series of data theft attacks, including\nHarvard University\nand the\nUniversity of Pennsylvania\n, which also confirmed Oracle EBS breaches impacting their staff and students.\nClop has been behind multiple data theft campaigns in the past, targeting\nGoAnywhere MFT\n,\nAccellion FTA\n,\nMOVEit Transfer\n,\nCleo\n, and, most recently,\nGladinet CentreStack\ncustomers.\nThe U.S. Department of State now\noffers a $10 million reward\nfor information linking the cybercrime gang's attacks to a foreign government.\nSince late October, several other U.S. universities have also been breached in\nvoice phishing attacks\n, with\nHarvard University\n,\nthe University of Pennsylvania\n, and\nPrinceton University\ndisclosing that systems used for development and alumni activities were compromised to steal the personal information of donors, students, alumni, staff, and faculty.\nUpdate December 22, 14:20 EST: Revised total number of UoPX enrolled students and academic staff.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nUniversity of Phoenix discloses data breach after Oracle hack\nUniversity of Pennsylvania confirms new data breach after Oracle hack\nDartmouth College confirms data breach after Clop extortion attack\nHarvard investigating breach linked to Oracle zero-day exploit\nLogitech confirms data breach after Clop extortion attack",
    "date_extraction": "2025-12-25T09:46:36.984671"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/coupang-breach-affecting-337-million-users-raises-data-protection-questions/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Penta Security",
    "contenu": "Coupang, South Korea's leading e-commerce platform, recently disclosed a data breach affecting 33.7 million customer accounts which is equivalent to nearly two-thirds of the Korean population.\nThis represents the largest e-commerce security incident in South Korea's history and could result in fines of up to $900 million (approximately 1.2 trillion KRW).\nThis breach exposed vulnerabilities in data protection systems, particularly for e-commerce platforms that handle sensitive data including transaction histories, delivery addresses, and payment methods.\nThe scale of the incident has raised concerns among customers and industry observers.\nUnauthorized Access Undetected for Five Months\nOn November 29, Coupang confirmed the unauthorized exposure of user names, phone numbers, email addresses, delivery address books, and purchase details.\nWhile the company detected unusual access on November 6 at 6:38 PM KST, it did not fully identify the breach until November 18 at 10:52 PM which is more than 12 days later.\nInvestigations revealed that attackers had accessed customer data via overseas servers for nearly five months, from June 24 to November 8.\nA former Coupang employee has been identified as a prime suspect. The individual had access to authentication services and retained access keys post-resignation, enabling the breach.\nData Not Legally Required to Be Encrypted\nThe leaked information was not subject to mandatory encryption under Korean law. Currently, the Personal Information Protection Act in South Korea requires encryption only for payment data such as credit card numbers and unique identifiers like resident registration numbers.\nAlthough information such as names, addresses, phone numbers, email addresses, and purchase history may seem less critical, combining these data points can create security risks.\nAnalyzing purchase history reveals lifestyle patterns and family structures, which, when linked to personal contact details, could lead to spear-phishing attacks or even physical threats.\nMoreover, cross-referencing this data with previously leaked payment information can enable re-identification attacks that precisely pinpoint individuals.\nLast line of defense for customer trust\nOne data breach is all it takes to lose customer trust, trigger massive regulatory fines, and halt operations for recovery.\nPrevent the risks by encrypting with D.AMO before it's too late.\nDownload Datasheet\nThe Case for Enterprise-Grade Encryption Solutions\nThis incident highlights the importance of\ndata encryption\n, even when it is not legally mandated. Unlike unencrypted data, which becomes immediately exploitable once leaked, encrypted data remains useless without the decryption keys.\nHowever, in the absence of legal obligations, many companies do not prioritize voluntary encryption.\nTo reduce risks from data breaches, organizations must implement proven encryption solutions from trusted cybersecurity vendors. Since its establishment in 1997, Penta Security has built expertise in data protection becoming a global leader in data security.\nIn 2004,\nPenta Security\nlaunched\nD.AMO\n, a data encryption platform that provides encryption, centralized control, and an independent key management system (KMS).\nOver the past 20 years, D.AMO has been deployed by over 10,000 enterprise customers, including major financial institutions, public sector entities, and large corporations, confirming its status as a leader in global cybersecurity.\nD.AMO supports multiple encryption methods—API-based, plug-in, and kernel-level encryption—without requiring application modification. This flexibility enables faster deployment, reducing setup times from months to days. It also offers integrated security features such as access control, auditing, and monitoring.\nConcerns about performance degradation due to encryption are natural, but modern technologies address these efficiently.\nFor example, D.AMO minimizes performance impact by offering column-level selective encryption based on data sensitivity and is compatible with every layer of an organization’s system environment.\nRecord Fines Expected Amid Public Outcry\nThe Coupang breach surpasses the previous SK Telecom USIM data leak involving 27 million users, which led to a fine of 134.8 billion KRW.\nUnder South Korea’s amended data protection laws, fines can reach up to 3% of annual revenue, which in Coupang’s case could range from 150 billion KRW to a maximum of 1.2 trillion KRW.\nJust two days after the breach was made public, class action movements began to form, with over 200,000 people joining related online forums. The breach was not an external cyberattack but rather a case of insider abuse of legitimate credentials.\nThe company’s extended detection period may also be viewed as a violation of mandatory safety measures potentially resulting in additional penalties.\nProactive Security with Verified Solutions\nThe Coupang data breach demonstrates that information not covered by encryption requirements can still pose risks when combined. Companies should consider protecting customer data beyond legal minimums by adopting encryption solutions from established cybersecurity providers like Penta Security.\nBeyond encryption tools, organizations need centralized management and\neffective key management systems\n.\nWith nearly 30 years of experience and continuous development, Penta Security provides cybersecurity solutions for various IT infrastructures—from on-premise systems to cloud, multi-cloud, and hybrid environments.\nMoreover, Penta Security’s D.AMO can encrypt all data types (structured and unstructured) and is deployable across all layers of IT systems, including OS, databases, and applications.\nAs the Coupang case shows, organizations may benefit from applying encryption beyond legally mandated data to help prevent similar incidents.\nDownload D.AMO Data Sheet\nSponsored and written by\nPenta Security\n.",
    "date_extraction": "2025-12-25T09:46:38.525207"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/cisa-flags-asus-live-update-cve-but-the-attack-is-years-old/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Ax Sharma",
    "contenu": "An ASUS Live Update vulnerability tracked as CVE-2025-59374 has been making the rounds in infosec feeds, with some headlines implying recent or ongoing exploitation.\nThe CVE documents a historic supply-chain attack in an End-of-Life (EoL) software product, not a newly emerging threat.\nNot all CISA KEVs signal urgency\nRecent coverage of CVE-2025-59374 has framed the issue as a newly relevant security risk\nfollowing its addition\nto CISA's Known Exploited Vulnerabilities (KEV) catalog.\nA closer look, however, shows the reality is much more nuanced.\nThe CVE documents the\n2018-2019 \"ShadowHammer\" supply-chain attack\n, in which maliciously modified ASUS Live Update binaries were selectively delivered to a small number of targeted systems.\nThe\nCVE entry\nfor the compromise, now-rated a 9.3 (Critical) on the CVSS scale, states:\n\"UNSUPPORTED WHEN ASSIGNED\" Certain versions of the ASUS Live Update client were distributed with unauthorized modifications introduced through a supply chain compromise. The modified builds could cause devices meeting specific targeting conditions to perform unintended actions. Only devices that met these conditions and installed the compromised versions were affected. The Live Update client has already reached End-of-Support (EOS) in October 2021, and no currently supported devices or products are affected by this issue.\nThe '\nunsupported when assigned\n' text already suggests that the CVE was filed for an EoL product.\nThe primary vendor advisory linked to in the CVE entry\nis from 2019\n. This advisory additionally links to an FAQ:\nhttps://www.asus.com/support/faq/1018727/\nbearing the last updated timestamp,\n2025/12/06 20:09\n.\nNote, however, this FAQ 1018727 link existed in that spot back in 2019 when the\nadvisory was first published\n.\nASUS 2019 advisory on ShadowHammer attack\n(BleepingComputer)\nAs seen by BleepingComputer, the FAQ page does not provide the\nfirst\npublication timestamp metadata. Rather, it has simply been updated this month and shows the aforementioned December 6th date on the page.\nASUS FAQ updated in December 2025 doesn't show original publication date\n(BleepingComputer)\nThe archived pages help us establish the purpose of the page, and why recent updates made to the page do not necessarily mean a renewed risk from the 2019 issue.\nThe FAQ entry appears to be ASUS' placeholder page, periodically revised to provide information on the upgrade path, i.e. the latest version users should adopt for the vendor's Live Update utility.\nFurthermore, the page continues to display (older) remediation guidance with screenshots bearing 2019 dates:\nASUS screenshots in updated FAQ still bear 2019 dates\n(BleepingComputer)\nTo get more information about the 2025 CVE assignment, BleepingComputer reached out to ASUS well in advance of publishing but we did not hear back.\nWe additionally reached out to CISA to understand what prompted the CVE's addition to the KEV catalog.\nCISA declined to provide additional comment, instead pointing BleepingComputer to language in Binding Operational Directive\n22-01\n, which notes:\n\"Addition of a vulnerability to the KEV catalog does not indicate that CISA is observing current active exploitation. If there is accurate reporting of active exploitation, any vulnerability, despite its age, can qualify for KEV catalog addition\"\nTaken together, the evidence suggests the CVE assignment reflects a retrospective classification effort, formally documenting a well-known attack that predated CVE issuance.\nPractical guidance for users\nYou should still ensure that you have the latest, patched version of the product.\nAccording to the CVE entry, the affected software, ASUS Live Update, reached End-of-Support (EOS) in October 2021, with \"no currently supported devices or products are affected by this issue.\"\nThe updated ASUS FAQ page from this month, however, contradicts this wording, implying that the support\ndefinitively\nended on December 4, 2025:\n\"We announced end of support for ASUS LiveUpdate on 2025/12/4,\nthe last version is 3.6.15.\n\"\nASUS FAQ updated in 2025 still mentions older upgrade advice beneath the updated instructions\n(BleepingComputer)\nEarlier copies\n(2019-22) of the FAQ recommended upgrading to \"V3.6.8 or higher version to resolve security concerns,\" as a fix for the issue was implemented in that version at the time. That dated advice has been left as-is on the updated FAQ from this month.\nThe release 3.6.15, however, is now listed as the \"last version.\" That version apparently\nexisted as early as March 2024\nif not before, meaning there is no new urgency to upgrade—contrary to the usual call-to-action following recent supply chain compromises.\nCVE-2025-59374 formalizes a well-documented historical attack. FAQ updates, older remediation guidance, the utility's latest release, and CISA context show the page was updated for documentation purposes, not to address a new exploit, impose patching requirements, or signal immediate risk.\nSecurity teams should therefore be mindful when treating CISA-linked CVEs as urgent, particularly for retired software or long-resolved incidents.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide",
    "date_extraction": "2025-12-25T09:46:40.081216"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/ukrainian-hacker-admits-affiliate-role-in-nefilim-ransomware-gang/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Sergiu Gatlan",
    "contenu": "A Ukrainian national pleaded guilty on Friday to conducting Nefilim ransomware attacks that targeted high-revenue businesses across the United States and other countries.\nThe defendant, 35-year-old Artem Aleksandrovych Stryzhak, was arrested in Spain in June 2024 and\nextradited to the U.S.\non April 30, 2025.\nStryzhak has admitted to computer fraud conspiracy charges brought by U.S. prosecutors in connection with ransomware attacks targeting businesses in the United States, Norway, France, Switzerland, Germany, and the Netherlands.\nIf found guilty, Stryzhak faces up to 10 years in prison, with sentencing scheduled for May 6, 2026.\nAccording to\ncourt documents\n, Stryzhak allegedly obtained access to the Nefilim ransomware code in June 2021 in exchange for 20% of the ransom payments collected. The ransomware operation created customized malware for each victim along with decryption keys and ransom demands.\nAfter joining the Nefilim operation, Stryzhak specifically targeted large corporations in the United States, Canada, and Australia with annual revenues exceeding $100 million, using custom-tailored malware for each victim along with decryption keys and ransom demands. However, one Nefilim administrator later encouraged Stryzhak to focus on companies generating more than $200 million annually.\nStryzhak and his accomplices researched potential targets using online platforms (including Zoominfo) to gather information about a company's revenue, size, and contact details.\nTo maximize pressure on victims, the group also threatened to leak data stolen during attacks on \"Corporate Leaks\" websites managed by the Nefilim admins unless ransom demands were met.\nThe U.S. State Department also\noffers up to $11 million\nfor information leading to the arrest of Stryzhak's alleged co-conspirator, Ukrainian national Volodymyr Tymoshchuk, who remains at large.\nTymoshchuk is on the most-wanted lists of both the\nFBI\nand the\nEuropean Union\n, and in September was\ncharged by the U.S. Justice Department\nwith his role as the administrator of the LockerGoga, MegaCortex, and Nefilim ransomware operations.\nTymoshchuk was allegedly involved in ransomware attacks that breached hundreds of companies worldwide, resulting in millions of dollars in damages between July 2020 and October 2021.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nUniversity of Phoenix data breach impacts nearly 3.5 million individuals\nUkrainian hacker charged with helping Russian hacktivist groups\nRussian bulletproof hosting provider sanctioned over ransomware ties\nUkrainian extradited from Ireland on Conti ransomware charges\nRomanian water authority hit by ransomware attack over weekend",
    "date_extraction": "2025-12-25T09:46:41.630837"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/over-115-000-watchguard-firewalls-vulnerable-to-ongoing-rce-attacks/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Sergiu Gatlan",
    "contenu": "Over 115,000 WatchGuard Firebox devices exposed online remain unpatched against a critical remote code execution (RCE) vulnerability actively exploited in attacks.\nThe security flaw, tracked as\nCVE-2025-14733\n, affects Firebox firewalls running Fireware OS 11.x and later (including 11.12.4_Update1), 12.x or later (including 12.11.5), and 2025.1 up to and including 2025.1.3.\nSuccessful exploitation enables unauthenticated attackers to execute arbitrary code remotely on vulnerable devices, following low-complexity attacks that don't require user interaction.\nAs WatchGuard explained in a Thursday advisory, when it\nreleased CVE-2025-14733 security updates\nand tagged it as exploited in the wild, unpatched Firebox firewalls are only vulnerable to attacks if configured for IKEv2 VPN. It also warned that even if vulnerable configurations are removed, the firewall may still be at risk if a Branch Office VPN (BOVPN) to a static gateway peer is still configured.\n\"WatchGuard Fireware OS iked process contains an out of bounds write vulnerability in the OS iked process,\" an\nNVD advisory explains\n. \"This vulnerability may allow a remote unauthenticated attacker to execute arbitrary code and affects both the mobile user VPN with IKEv2 and the branch office VPN using IKEv2 when configured with a dynamic gateway peer.\"\nWatchGuard has\nshared indicators of compromise\nto help customers identify compromised Firebox appliances on their network, advising those who find signs of malicious activity to rotate all locally stored secrets on vulnerable firewalls. It also\nprovided a temporary workaround\nfor network defenders who can't immediately patch vulnerable devices, requiring them to disable dynamic peer BOVPNs, add new firewall policies, and disable the default system policies that handle VPN traffic.\nOn Saturday, the Internet security watchdog group Shadowserver found\nover 124,658 unpatched Firebox instances exposed online\n, with 117,490\nstill exposed\non Sunday.\nWatchGuard firewall instances exposed online (Shadowserver)\n​One day after WatchGuard released patches, CISA\nadded\nCVE-2025-14733 to its\nKnown Exploited Vulnerabilities (KEV) Catalog\n.\nThe U.S. cybersecurity agency also ordered Federal Civilian Executive Branch (FCEB) agencies (executive branch non-military agencies, such as the Department of Energy, the Department of the Treasury, and the Department of Homeland Security) to patch Firebox firewalls within a week, by December 26th, as mandated by the Binding Operational Directive (BOD) 22-01.\n\"This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise,\" CISA warned. \"Apply mitigations per vendor instructions, follow applicable BOD 22-01 guidance for cloud services, or discontinue use of the product if mitigations are unavailable.\"\nIn September, WatchGuard\npatched an almost identical RCE vulnerability\n(CVE-2025-9242) impacting Firebox firewalls. One month later, Shadowserver\nfound over 75,000 Firebox firewalls\nvulnerable to CVE-2025-9242 attacks, most in North America and Europe, with CISA later tagging the security flaw as actively exploited in the wild and\nordering federal agencies\nto secure their Firebox appliances from ongoing attacks.\nTwo years ago, CISA also ordered U.S. government agencies to patch another actively exploited WatchGuard flaw (CVE-2022-23176)\nimpacting Firebox and XTM firewall appliances\n.\nWatchGuard works with over 17,000 security resellers and service providers to protect the networks of more than 250,000 small and mid-sized companies worldwide.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nNew critical WatchGuard Firebox firewall flaw exploited in attacks\nOver 75,000 WatchGuard security devices vulnerable to critical RCE\nNearly 50,000 Cisco firewalls vulnerable to actively exploited flaws\nOver 2,000 Palo Alto firewalls hacked using recently patched bugs\nOver 28,000 Citrix devices vulnerable to new exploited RCE flaw",
    "date_extraction": "2025-12-25T09:46:43.314651"
  },
  {
    "source": "BleepingComputer",
    "url": "https://www.bleepingcomputer.com/news/security/docker-hardened-images-now-open-source-and-available-for-free/",
    "titre": "Titre non trouvé",
    "date": "",
    "auteur": "Bill Toulas",
    "contenu": "More than a 1,000 Docker Hardened Images (DHI) are now freely available and open source for software builders, under the Apache 2.0 license.\nDocker is a popular platform that enables developers to build, test, and deploy applications quickly inside container images that include the required dependencies, allowing for predictable and repeatable results across various systems and environments.\nDHIs, launched in May this year, are secure, minimal, production-ready Docker base images maintained directly by Docker. They are designed to reduce the attack surface and supply-chain risks at the container layer.\nDHIs are rootless, stripped of unnecessary components, free of known vulnerabilities, and support the Vulnerability Exploitability eXchange (VEX) standard for leaner security management.\nThey are also guaranteed to push fixes for new flaws in existing DHI components within 7 days of their disclosure.\nIn October, the Docker team announced that it would\nopen unlimited access\nto its entire DHI catalog of 1,000 images to all developer teams and also offer a 30-day free trial to all subscribers.\nHowever, Docker decided to move DHIs from being a commercial offering to making them available subscription-free for all developers.\n“Today, we are establishing a new industry standard by making DHI freely available and open source to everyone who builds software. All 26 Million+ developers in the container ecosystem,”\nreads the announcement\n.\n“DHI is fully open and free to use, share, and build on with no licensing surprises, backed by an Apache 2.0 license. DHI now gives the world a secure, minimal, production-ready foundation from the very first pull,” the company said.\nDocker has highlighted that the move does not come with security discounts for DHI, as the images remain SBOM-verifiable, the builds provide SLSA Build Level 3 provenance, and every image is accompanied by proof of authenticity.\nHowever, the 7-day critical CVE patching commitment (SLA) is still exclusive to the commercial tier, DHI Enterprise, which is still available. Patches will still be provided to the free tier, but not within a pre-defined time period.\nRegarding DHI Enterprise and the time to fix flaws, Docker states it aims to reduce it to a single day or even less. The commercial tier also allows modifying DHI images, configuring runtimes, and installing additional tools.\nDocker users can access the full DHI catalog and subscription options\nfrom here\n.\nBreak down IAM silos like Bitpanda, KnowBe4, and PathAI\nBroken IAM isn't just an IT problem - the impact ripples across your whole business.\nThis practical guide covers why traditional IAM practices fail to keep up with modern demands, examples of what \"good\" IAM looks like, and a simple checklist for building a scalable strategy.\nGet the guide\nRelated Articles:\nShai-Hulud 2.0 NPM malware attack exposed up to 400,000 dev secrets\nNew ‘IndonesianFoods’ spammer floods npm with 150,000 packages\nDangerous runC flaws could allow hackers to escape Docker containers\nOpen VSX rotates access tokens used in supply-chain malware attack\nNew EDR-Freeze tool uses Windows WER to suspend security software",
    "date_extraction": "2025-12-25T09:46:44.960595"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
    "titre": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.\nFREE SPEECH\nPresident Trump has repeatedly claimed that a primary reason he lost the 2020 election was that social media and Big Tech companies had conspired to silence conservative voices and stifle free speech. Naturally, the president’s impulse in his second term has been to use the levers of the federal government in an effort to limit the speech of everyday Americans, as well as foreigners wishing to visit the United States.\nIn September, Donald Trump signed a national security directive known as\nNSPM-7\n, which directs federal law enforcement officers and intelligence analysts to target “anti-American” activity, including any “tax crimes” involving extremist groups who defrauded the IRS. According to\nextensive reporting\nby journalist\nKen Klippenstein\n, the focus of the order is on those expressing “opposition to law and immigration enforcement; extreme views in favor of mass migration and open borders; adherence to radical gender ideology,” as well as “anti-Americanism,” “anti-capitalism,” and “anti-Christianity.”\nEarlier this month,\nAttorney General Pam Bondi\nissued a memo\nadvising the FBI to compile a list of Americans whose activities “may constitute domestic terrorism.” Bondi also ordered the FBI to establish a “\ncash reward system\n” to encourage the public to report suspected domestic terrorist activity. The memo states that domestic terrorism could include “opposition to law and immigration enforcement” or support for “radical gender ideology.”\nThe Trump administration also is planning to\nimpose social media restrictions\non tourists as the president continues to ramp up travel restrictions for foreign visitors. According to\na notice\nfrom\nU.S. Customs and Border Protection\n(CBP), tourists — including those from Britain, Australia, France, and Japan — will soon be required to provide five years of their social media history.\nThe CBP said it will also collect “several high value data fields,” including applicants’ email addresses from the past 10 years, their telephone numbers used in the past five years, and names and details of family members. Wired\nreported\nin October that the US CBP executed more device searches at the border in the first three months of the year than any other previous quarter.\nThe new requirements from CBP add meat to the bones of\nExecutive Order 14161\n, which in the name of combating “foreign terrorist and public safety threats” granted broad new authority that civil rights groups warn could enable a renewed travel ban and expanded visa denials or deportations based on perceived ideology. Critics alleged the order’s vague language around “public safety threats,” creates latitude for targeting individuals based on political views, national origin, or religion. At least 35 nations are now\nunder some form of U.S. travel restrictions\n.\nCRIME AND CORRUPTION\nIn February, Trump\nordered\nexecutive branch agencies to stop enforcing the\nU.S. Foreign Corrupt Practices Act\n, which froze foreign bribery investigations, and even allows for “remedial actions” of past enforcement actions deemed “inappropriate.”\nThe White House also disbanded the\nKleptocracy Asset Recovery Initiative\nand\nKleptoCapture Task Force\n— units which proved their value in corruption cases and in seizing the assets of sanctioned Russian oligarchs — and diverted resources away from investigating white-collar crime.\nAlso in February, Attorney General Pam Bondi\ndissolved\nthe FBI’s\nForeign Influence Task Force\n, an entity created during Trump’s first term designed to counter the influence of foreign governments on American politics.\nIn March 2025, Reuters\nreported\nthat several U.S. national security agencies had halted work on a coordinated effort to counter Russian sabotage, disinformation and cyberattacks. Former President Joe Biden had ordered his national security team to establish working groups to monitor the issue amid warnings from U.S. intelligence that Russia was escalating a shadow war against Western nations.\nIn a test of prosecutorial independence, Trump’s Justice Department ordered prosecutors to drop the corruption case against New York Mayor\nEric Adams\n. The fallout was immediate: Multiple senior officials resigned in protest, the case was reassigned, and chaos engulfed the Southern District of New York (SDNY) – historically one of the nation’s most aggressive offices for pursuing public corruption, white-collar crime, and cybercrime cases.\nWhen it comes to cryptocurrency, the administration has shifted regulators at the\nU.S. Securities and Exchange Commission\n(SEC) away from enforcement to cheerleading an industry that has consistently been plagued by scams, fraud and rug-pulls. The SEC in 2025 systematically retreated from enforcement against cryptocurrency operators, dropping major cases against\nCoinbase\n,\nBinance\n, and others.\nPerhaps the most troubling example involves\nJustin Sun\n, the Chinese-born founder of crypto currency company\nTron\n. In 2023, the SEC charged Sun with fraud and market manipulation. Sun subsequently invested $75 million in the Trump family’s\nWorld Liberty Financial\n(WLF) tokens, became the top holder of the $TRUMP memecoin, and secured a seat at an exclusive dinner with the president.\nIn late February 2025, the SEC dropped its lawsuit. Sun promptly took Tron public through a reverse merger arranged by Dominari Securities, a firm with Trump family ties. Democratic lawmakers have urged the SEC to investigate what they call “concerning ties to President Trump and his family” as potential conflicts of interest and foreign influence.\nIn October, President Trump pardoned\nChangpeng Zhao\n, the founder of the world’s largest cryptocurrency exchange\nBinance\n. In 2023, Zhao and his company pled guilty to failing to prevent money laundering on the platform. Binance paid a $4 billion fine, and Zhao served a four-month sentence. As\nCBS News\nobserved last month, shortly after Zhao’s pardon application, he was at the center of a blockbuster deal that put the Trump’s family’s WLF on the map.\n“Zhao is a citizen of the United Arab Emirates in the Persian Gulf and in May, an Emirati fund put $2 billion in Zhao’s Binance,” 60 Minutes\nreported\n. “Of all the currencies in the world, the deal was done in World Liberty crypto.”\nSEC Chairman\nPaul Atkins\nhas made the agency’s new posture towards crypto explicit, stating “most crypto tokens are not securities.” At the same time, President Trump has directed the\nDepartment of Labor\nand the SEC\nto expand 401(k) access to private equity and crypto\n— assets that regulators have historically restricted for retail investors due to high risk, fees, opacity, and illiquidity. The executive order explicitly prioritizes “curbing ERISA litigation,” and reducing accountability for fiduciaries while shifting risk onto ordinary workers’ retirement savings.\nAt the White House’s behest, the U.S. Treasury in March\nsuspended\nthe\nCorporate Transparency Act\n, a law that required companies to reveal their real owners. Finance experts warned the suspension would bring back shell companies and “\nopen the flood gates of dirty money\n” through the US, such as funds from drug gangs, human traffickers, and fraud groups.\nTrump’s clemency decisions have created a pattern of freed criminals committing new offenses, including\nJonathan Braun\n, whose sentence for drug trafficking was commuted during Trump’s first term, was found guilty in 2025 of violating supervised release and faces new charges.\nEliyahu Weinstein\n, who received a commutation in January 2021 for running a Ponzi scheme, was sentenced in November 2025 to 37 years for running a new Ponzi scheme. The administration has also granted clemency to a growing list of white-collar criminals:\nDavid Gentile\n, a private equity executive sentenced to seven years for securities and wire fraud (functionally a ponzi-like scheme), and\nTrevor Milton\n, the Nikola founder sentenced to four years for defrauding investors over electric vehicle technology. The message: Financial crimes against ordinary investors are no big deal.\nAt least 10 of the January 6 insurrectionists pardoned by President Trump\nhave already been rearrested, charged or sentenced for other crimes\n, including plotting the murder of FBI agents, child sexual assault, possession of child sexual abuse material and reckless homicide while driving drunk.\nThe administration also\nimposed sanctions\nagainst the\nInternational Criminal Court\n(ICC). On February 6, 2025, Executive Order 14203 authorized asset freezes and visa restrictions against ICC officials investigating U.S. citizens or allies, primarily in response to the ICC’s arrest warrants for Israeli Prime Minister Benjamin Netanyahu over alleged war crimes in Gaza.\nEarlier this month the president launched the “\nGold Card\n,” a visa scheme established by an executive order in September that offers wealthy individuals and corporations expedited paths to U.S. residency and citizenship\nin exchange for $1 million for individuals and $2 million for companies\n, plus ongoing fees. The administration says it is also planning to offer a “platinum” version of the card that offers special tax breaks — for a cool $5 million.\nFEDERAL CYBERSECURITY\nPresident Trump campaigned for a second term insisting that the previous election was riddled with fraud and had been stolen from him. Shortly after Mr. Trump took the oath of office for a second time, he fired the head of the\nCybersecurity and Infrastructure Security Agency\n(CISA) —\nChris Krebs\n(no relation) — for having the audacity to state publicly that the 2020 election was the most secure in U.S. history.\nMr. Trump revoked Krebs’s security clearances, ordered a Justice Department investigation into his election security work, and suspended the security clearances of employees at\nSentinelOne\n, the cybersecurity firm where Krebs worked as chief intelligence and public policy officer. The executive order was the first direct presidential action against any US cybersecurity company. Krebs subsequently resigned from SentinelOne, telling The Wall Street Journal he was leaving to push back on Trump’s efforts “to go after corporate interests and corporate relationships.”\nThe president also dismissed all 15 members of the\nCyber Safety Review Board\n(CSRB), a nonpartisan government entity established in 2022 with a mandate to investigate the security failures behind major cybersecurity events — likely because those advisors included Chris Krebs.\nAt the time, the CSRB was in the middle of compiling a much-anticipated report on the root causes of Chinese government-backed digital intrusions into at least nine U.S. telecommunications providers. Not to be outdone, the\nFederal Communication Commission\nquickly moved to\nroll back a previous ruling\nthat required U.S. telecom carriers to implement stricter cybersecurity measures.\nMeanwhile, CISA has lost roughly a third of its workforce this year amid mass layoffs and deferred resignations. When the government shutdown began in October, CISA laid off even more employees and furloughed 65 percent of the remaining staff, leaving\nonly 900 employees\nworking without pay.\nAdditionally, the Department of Homeland Security has reassigned CISA cyber specialists to jobs supporting the president’s deportation agenda. As\nBloomberg\nreported\nearlier this year, CISA employees were given a week to accept the new roles or resign, and some of the reassignments included relocations to new geographic areas.\nThe White House has signaled that it plans to\ncut an additional $491 million from CISA’s budget next year\n, cuts that primarily target CISA programs focused on international affairs and countering misinformation and foreign propaganda. The president’s budget proposal justified the cuts by repeating debunked claims about CISA engaging in censorship.\nThe Trump administration has pursued a similar reorganization at the FBI:\nThe Washington Post\nreported in October\nthat a quarter of all FBI agents have now been reassigned from national security threats to immigration enforcement. Reuters reported last week that the replacement of seasoned leaders at the FBI and Justice Department with Trump loyalists has led to an unprecedented number of prosecutorial missteps, resulting in a\n21 percent dismissal rate\nof the D.C. U.S. attorney’s office criminal complaints over eight weeks, compared to a mere .5% dismissal rate over the prior 10 years.\n“These mistakes are causing department attorneys to lose credibility with federal courts, with some judges quashing subpoenas, threatening criminal contempt and issuing opinions that raise questions about their conduct,” Reuters reported. “Grand juries have also in some cases started rejecting indictments, a highly unusual event since prosecutors control what evidence gets presented.”\nIn August, the DHS\nbanned state and local governments from using cyber grants\non services provided by the\nMulti-State Information Sharing and Analysis Center\n(MS-ISAC), a group that for more than 20 years has shared critical cybersecurity intelligence across state lines and provided software and other resources at free or heavily discounted rates. Specifically, DHS barred states from spending funds on services offered by the\nElections Infrastructure ISAC\n, which was\neffectively shuttered\nafter DHS pulled its funding in February.\nCybersecurity Dive\nreports\nthat the Trump administration’s massive workforce cuts, along with widespread mission uncertainty and a persistent leadership void, have interrupted federal agencies’ efforts to collaborate with the businesses and local utilities that run and protect healthcare facilities, water treatment plans, energy companies and telecommunications networks. The publication said the changes came after the US government eliminated\nCIPAC\n— a framework that allowed private companies to share cyber and threat intel without legal penalties.\n“Government leaders have canceled meetings with infrastructure operators, forced out their longtime points of contact, stopped attending key industry events and scrapped a coordination program that made companies feel comfortable holding sensitive talks about cyberattacks and other threats with federal agencies,” Cybersecurity Dive’s\nEric Geller\nwrote.\nBoth the\nNational Security Agency\n(NSA) and\nU.S. Cyber Command\nhave been without a leader since Trump dismissed\nAir Force General Timothy Haugh\nin April, allegedly for disloyalty to the president and at the suggestion of far-right conspiracy theorist Laura Loomer. The nomination of Army Lt. Gen. William Hartman for the same position fell through in October. The White House has\nordered the NSA to cut 8 percent of its civilian workforce\n(between 1,500 and 2,000 employees).\nAs\nThe Associated Press\nreported\nin August, the\nOffice of the Director of National Intelligence\nplans to dramatically reduce its workforce and cut its budget by more than $700 million annually. Director of National Intelligence\nTulsi Gabbard\nsaid the cuts were warranted because ODNI had become “bloated and inefficient, and the intelligence community is rife with abuse of power, unauthorized leaks of classified intelligence, and politicized weaponization of intelligence.”\nThe firing or forced retirements of so many federal employees has been a boon to foreign intelligence agencies. Chinese intelligence agencies, for example,\nreportedly\nmoved quickly to take advantage of the mass layoffs, using a network of front companies to recruit laid-off U.S. government employees for “consulting work.” Former workers with the Defense Department’s\nDefense Digital Service\nwho resigned en-masse earlier this year thanks to DOGE encroaching on their mission\nhave been approached\nby the United Arab Emirates to work on artificial intelligence for the oil kingdom’s armed forces, albeit reportedly with the blessing of the Trump administration.\nPRESS FREEDOM\nPresident Trump has filed multibillion-dollar lawsuits\nagainst a number of major news outlets\nover news segments or interviews that allegedly portrayed him in a negative light, suing the networks\nABC\n, the\nBBC\n, the\nCBS\nparent company\nParamount\n,\nThe Wall Street Journal\n, and\nThe New York Times\n, among others.\nThe president signed an executive order aimed at slashing public subsidies to\nPBS\nand\nNPR\n, alleging “bias” in the broadcasters’ reporting. In July, Congress approved a request from Trump to cut $1.1 billion in federal funding for the\nCorporation for Public Broadcasting\n, the nonprofit entity that funds PBS and NPR.\nBrendan Carr\n, the president’s pick to run the\nFederal Communications Commission\n(FCC), initially pledged to “dismantle the censorship cartel and restore free speech rights for everyday Americans.” But on January 22, 2025, the FCC reopened complaints against ABC, CBS and\nNBC\nover their coverage of the 2024 election. The previous FCC chair had dismissed the complaints as attacks on the First Amendment and an attempt to weaponize the agency for political purposes.\nPresident Trump in February\nseized control\nof the\nWhite House Correspondents’ Association\n, the nonprofit entity that decides which media outlets should have access to the White House and the press pool that follows the president. The president invited an additional 32 media outlets, mostly conservative or right-wing organizations.\nAccording to the journalism group\nPoynter.org\n, there are three religious networks, all of which lean conservative, as well as a mix of outlets that includes a legacy paper, television networks, and a digital outlet powered by artificial intelligence.  Trump also barred\nThe Associated Press\nfrom the White House over their refusal to refer to the Gulf of Mexico as the Gulf of America.\nUnder Trump appointee\nKari Lake\n, the\nU.S. Agency for Global Media\nmoved to dismantle\nVoice of America\n,\nRadio Free Europe/Radio Liberty\n, and other networks that for decades served as credible news sources behind authoritarian lines. Courts blocked shutdown orders, but the damage continues through administrative leave, contract terminations, and funding disputes.\nPresident Trump this term has\nfired most of the people\ninvolved in processing\nFreedom of Information Act\n(FOIA) requests for government agencies. FOIA is an indispensable tool used by journalists and the public to request government records, and to hold leaders accountable.\nPetitioning the government, particularly when it ignores your requests, often requires challenging federal agencies in court. But that becomes far more difficult if the most competent law firms start to shy away from cases that may involve crossing the president and his administration. On March 22, the president issued\na memorandum\nthat directs heads of the Justice and Homeland Security Departments to “seek sanctions against attorneys and law firms who engage in frivolous, unreasonable and vexatious litigation against the United States,” or in matters that come before federal agencies.\nThe Trump administration announced\nincreased vetting of applicants for H-1B visas\nfor highly skilled workers, with an internal State Department memo saying that anyone involved in “censorship” of free speech should be considered for rejection.\nExecutive Order 14161\n, issued in 2025 on “foreign terrorist and public safety threats,” granted broad new authority that civil rights groups warn could enable a renewed travel ban and expanded visa denials or deportations based on perceived ideology. Critics charged that the order’s vague language around “public safety threats” creates latitude for targeting individuals based on political views, national origin, or religion.\nCONSUMER PROTECTION, PRIVACY\nAt the beginning of this year, President Trump ordered staffers at the\nConsumer Financial Protection Bureau\n(CFPB) to stop most work. Created by Congress in 2011 to be a clearinghouse of consumer complaints, the CFPB has sued some of the nation’s largest financial institutions for violating consumer protection laws. The CFPB says its actions have put nearly $18 billion back in Americans’ pockets in the form of monetary compensation or canceled debts, and imposed $4 billion in civil money penalties against violators.\nThe Trump administration said it planned to fire up to 90 percent of all CFPB staff, but a recent federal appeals court ruling in Washington tossed out an earlier decision that would have allowed the firings to proceed. Reuters\nreported this week\nthat an employee union and others have battled against it in court for ten months, during which the agency has been almost completely idled.\nThe CFPB’s acting director is\nRussell Vought\n, a key architect of the GOP policy framework Project 2025. Under Vought’s direction, the CFPB in May\nquietly withdrew a data broker protection rule\nintended to limit the ability of U.S. data brokers to sell personal information on Americans.\nDespite the Federal Reserve’s own post-mortem\nexplicitly blaming Trump-era deregulation\nfor the 2023 Silicon Valley Bank collapse, which triggered a fast-moving crisis requiring emergency weekend bailouts of banks, Trump’s banking regulators in 2025 doubled down. They loosened capital requirements, narrowed definitions of “unsafe” banking practices, and stripped specific risk categories from supervisory frameworks. The setup for another banking crisis requiring taxpayer intervention is now in place.\nThe Privacy Act of 1974, one of the few meaningful federal privacy laws, was built on the principles of consent and separation in response to the abuses of power that came to light during the Watergate era. The law states that when an individual provides personal information to a federal agency to receive a particular service, that data must be used\nsolely for its original purpose\n.\nNevertheless, it emerged in June that the Trump administration has built a central database of all US citizens. According to\nNPR\n, the White House plans to use the new platform during upcoming elections to verify the identity and citizenship status of US voters. The database was built by the Department of Homeland Security and the Department of Governmental Efficiency and is being rolled out in phases to US states.\nDOGE\nProbably the biggest ungotten scoop of 2025 is the inside story of what happened to all of the personal, financial and other sensitive data that was accessed by workers at the so-called\nDepartment of Government Efficiency\n(DOGE). President Trump tapped\nElon Musk\nto lead the newly created department, which was mostly populated by current and former employees of Musk’s various technology companies (including\na former denizen of the cybercrime community known as the “Com”\n). It soon emerged that the DOGE team was using artificial intelligence\nto surveil at least one federal agency’s communications\nfor hostility to Mr. Trump and his agenda.\nDOGE employees were able to access and synthesize data taken from a large number of\npreviously separate\nand highly guarded federal databases, including those at the Social Security Administration, the Department of Homeland Security, the Office of Personnel Management, and the U.S. Department of the Treasury. DOGE staffers did so largely by circumventing or dismantling security measures designed to detect and prevent misuse of federal databases, including standard incident response protocols, auditing, and change-tracking mechanisms.\nFor example, an IT expert with the\nNational Labor Relations Board\n(NLRB)\nalleges\nthat DOGE employees likely downloaded gigabytes of data from agency case files in early March, using short-lived accounts that were configured to leave few traces of network activity. The NLRB whistleblower said the large data outflows coincided with multiple blocked login attempts from addresses in Russia, which attempted to use valid credentials for a newly-created DOGE user account.\nThe stated goal of DOGE was to reduce bureaucracy and to massively cut costs — mainly by eliminating funding for a raft of federal initiatives that had already been approved by Congress. The DOGE website claimed those efforts reduced “wasteful” and “fraudulent” federal spending by more than $200 billion. However, multiple independent reviews by news organizations determined the true “savings” DOGE achieved was off by a couple of orders of magnitude, and was likely closer to $2 billion.\nAt the same time DOGE was slashing federal programs, President Trump\nfired at least 17 inspectors general\nat federal agencies — the very people tasked with actually identifying and stopping waste, fraud and abuse at the federal level. Those included several agencies (such as the NLRB) that had open investigations into one or more of Mr. Musk’s companies for allegedly failing to comply with protocols aimed at protecting state secrets. In September, a federal judge found the president\nunlawfully fired the agency watchdogs\n, but none of them have been reinstated.\nWhere is DOGE now?\nReuters\nreported last month that as far as the White House is concerned,\nDOGE no longer exists\n, even though it technically has more than half a year left to its charter. Meanwhile, who exactly retains access to federal agency data that was fed by DOGE into AI tools is anyone’s guess.\nKrebsOnSecurity would like to thank the anonymous researcher\nNatInfoSec\nfor assisting with the research on this story.",
    "date_extraction": "2025-12-25T09:46:46.355425"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
    "titre": "Most Parked Domains Now Serving Malicious Content",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "Direct navigation — the act of visiting a website by manually typing a domain name in a web browser — has never been riskier: A new study finds the vast majority of “parked” domains — mostly expired or dormant domain names, or common misspellings of popular websites — are now configured to redirect visitors to sites that foist scams and malware.\nA lookalike domain to the FBI Internet Crime Complaint Center website, returned a non-threatening parking page (left) whereas a mobile user was instantly directed to deceptive content in October 2025 (right). Image: Infoblox.\nWhen Internet users try to visit expired domain names or accidentally navigate to a lookalike “typosquatting” domain, they are typically brought to a placeholder page at a domain parking company that tries to monetize the wayward traffic by displaying links to a number of third-party websites that have paid to have their links shown.\nA decade ago, ending up at one of these parked domains came with a relatively small chance of being redirected to a malicious destination: In 2014, researchers\nfound\n(PDF) that parked domains redirected users to malicious sites less than five percent of the time — regardless of whether the visitor clicked on any links at the parked page.\nBut in a series of experiments over the past few months, researchers at the security firm\nInfoblox\nsay they discovered the situation is now reversed, and that malicious content is by far the norm now for parked websites.\n“In large scale experiments, we found that over 90% of the time, visitors to a parked domain would be directed to illegal content, scams, scareware and anti-virus software subscriptions, or malware, as the ‘click’ was sold from the parking company to advertisers, who often resold that traffic to yet another party,” Infoblox researchers wrote in\na paper published today\n.\nInfoblox found parked websites are benign if the visitor arrives at the site using a virtual private network (VPN), or else via a non-residential Internet address. For example,\nScotiabank.com\ncustomers who accidentally mistype the domain as\nscotaibank[.]com\nwill see a normal parking page if they’re using a VPN, but will be redirected to a site that tries to foist scams, malware or other unwanted content if coming from a residential IP address. Again, this redirect happens just by visiting the misspelled domain with a mobile device or desktop computer that is using a residential IP address.\nAccording to Infoblox, the person or entity that owns scotaibank[.]com has a portfolio of nearly 3,000 lookalike domains, including\ngmai[.]com\n, which demonstrably has been configured with its own mail server for accepting incoming email messages. Meaning, if you send an email to a Gmail user and accidentally omit the “l” from “gmail.com,” that missive doesn’t just disappear into the ether or produce a bounce reply: It goes straight to these scammers. The report notices this domain also has been leveraged in multiple recent business email compromise campaigns, using a lure indicating a failed payment with trojan malware attached.\nInfoblox found this particular domain holder (betrayed by a common DNS server — torresdns[.]com) has set up typosquatting domains targeting dozens of top Internet destinations, including\nCraigslist\n,\nYouTube\n,\nGoogle\n,\nWikipedia\n,\nNetflix\n,\nTripAdvisor\n,\nYahoo\n,\neBay\n, and\nMicrosoft\n. A defanged list of these typosquatting domains is\navailable here\n(the dots in the listed domains have been replaced with commas).\nDavid Brunsdon\n, a threat researcher at Infoblox, said the parked pages send visitors through a chain of redirects, all while profiling the visitor’s system using IP geolocation, device fingerprinting, and cookies to determine where to redirect domain visitors.\n“It was often a chain of redirects — one or two domains outside the parking company — before threat arrives,” Brunsdon said. “Each time in the handoff the device is profiled again and again, before being passed off to a malicious domain or else a decoy page like Amazon.com or Alibaba.com if they decide it’s not worth targeting.”\nBrunsdon said domain parking services claim the search results they return on parked pages are designed to be relevant to their parked domains, but that almost none of this displayed content was related to the lookalike domain names they tested.\nSamples of redirection paths when visiting scotaibank dot com. Each branch includes a series of domains observed, including the color-coded landing page. Image: Infoblox.\nInfoblox said a different threat actor who owns\ndomaincntrol[.]com\n— a domain that differs from GoDaddy’s name servers by a single character — has long taken advantage of typos in DNS configurations to drive users to malicious websites. In recent months, however, Infoblox discovered the malicious redirect only happens when the query for the misconfigured domain comes from a visitor who is using Cloudflare’s DNS resolvers (1.1.1.1), and that all other visitors will get a page that refuses to load.\nThe researchers found that even variations on well-known government domains are being targeted by malicious ad networks.\n“When one of our researchers tried to report a crime to the FBI’s\nInternet Crime Complaint Center\n(IC3), they accidentally visited ic3[.]org instead of ic3[.]gov,” the report notes. “Their phone was quickly redirected to a false ‘Drive Subscription Expired’ page. They were lucky to receive a scam; based on what we’ve learnt, they could just as easily receive an information stealer or trojan malware.”\nThe Infoblox report emphasizes that the malicious activity they tracked is not attributed to any known party, noting that the domain parking or advertising platforms named in the study were not implicated in the malvertising they documented.\nHowever, the report concludes that while the parking companies claim to only work with top advertisers, the traffic to these domains was frequently sold to affiliate networks, who often resold the traffic to the point where the final advertiser had no business relationship with the parking companies.\nInfoblox also pointed out that recent policy changes by\nGoogle\nmay have inadvertently increased the risk to users from direct search abuse. Brunsdon said\nGoogle Adsense\npreviously defaulted to allowing their ads to be placed on parked pages, but that in early 2025 Google implemented a default setting that had their customers\nopt-out by default\non presenting ads on parked domains — requiring the person running the ad to voluntarily go into their settings and turn on parking as a location.",
    "date_extraction": "2025-12-25T09:46:47.442576"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
    "titre": "Microsoft Patch Tuesday, December 2025 Edition",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "Microsoft\ntoday pushed updates to fix at least 56 security flaws in its\nWindows\noperating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.\nDespite releasing a lower-than-normal number of security updates these past few months, Microsoft patched a whopping 1,129 vulnerabilities in 2025, an 11.9% increase from 2024. According to\nSatnam Narang\nat\nTenable\n, this year marks the second consecutive year that Microsoft patched over one thousand vulnerabilities, and the third time it has done so since its inception.\nThe zero-day flaw patched today is\nCVE-2025-62221\n, a privilege escalation vulnerability affecting\nWindows 10\nand later editions. The weakness resides in a component called the “\nWindows Cloud Files Mini Filter Driver\n” — a system driver that enables cloud applications to access file system functionalities.\n“This is particularly concerning, as the mini filter is integral to services like OneDrive, Google Drive, and iCloud, and remains a core Windows component, even if none of those apps were installed,” said\nAdam Barnett\n, lead software engineer at\nRapid7\n.\nOnly three of the flaws patched today earned Microsoft’s most-dire “critical” rating: Both\nCVE-2025-62554\nand\nCVE-2025-62557\ninvolve\nMicrosoft Office\n, and both can exploited merely by viewing a booby-trapped email message in the Preview Pane. Another critical bug —\nCVE-2025-62562\n— involves\nMicrosoft Outlook\n, although Redmond says the Preview Pane is not an attack vector with this one.\nBut according to Microsoft, the vulnerabilities most likely to be exploited from this month’s patch batch are other (non-critical) privilege escalation bugs, including:\n–\nCVE-2025-62458\n— Win32k\n–\nCVE-2025-62470\n— Windows Common Log File System Driver\n–\nCVE-2025-62472\n— Windows Remote Access Connection Manager\n–\nCVE-2025-59516\n— Windows Storage VSP Driver\n–\nCVE-2025-59517\n— Windows Storage VSP Driver\nKev Breen\n, senior director of threat research at\nImmersive\n, said privilege escalation flaws are observed in almost every incident involving host compromises.\n“We don’t know why Microsoft has marked these specifically as more likely, but the majority of these components have historically been exploited in the wild or have enough technical detail on previous CVEs that it would be easier for threat actors to weaponize these,” Breen said. “Either way, while not actively being exploited, these should be patched sooner rather than later.”\nOne of the more interesting vulnerabilities patched this month is\nCVE-2025-64671\n, a remote code execution flaw in the\nGithub Copilot Plugin for Jetbrains\nAI-based coding assistant that is used by Microsoft and GitHub. Breen said this flaw would allow attackers to execute arbitrary code by tricking the large language model (LLM) into running commands that bypass the user’s “auto-approve” settings.\nCVE-2025-64671 is part of a broader, more systemic security crisis that security researcher\nAri Marzuk\nhas branded\nIDEsaster\n(IDE  stands for “integrated development environment”), which encompasses more than 30 separate vulnerabilities reported in nearly a dozen market-leading AI coding platforms, including\nCursor\n,\nWindsurf\n,\nGemini CLI\n, and\nClaude Code\n.\nThe other publicly-disclosed vulnerability patched today is\nCVE-2025-54100\n, a remote code execution bug in\nWindows Powershell\non Windows Server 2008 and later that allows an unauthenticated attacker to run code in the security context of the user.\nFor anyone seeking a more granular breakdown of the security updates Microsoft pushed today, check out the roundup at the\nSANS Internet Storm Center\n. As always, please leave a note in the comments if you experience problems applying any of this month’s Windows patches.",
    "date_extraction": "2025-12-25T09:46:48.526673"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/12/drones-to-diplomas-how-russias-largest-private-university-is-linked-to-a-25m-essay-mill/",
    "titre": "Drones to Diplomas: How Russia’s Largest Private University is Linked to a $25M Essay Mill",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "A sprawling academic cheating network turbocharged by Google Ads that has generated nearly $25 million in revenue has curious ties to a Kremlin-connected oligarch whose Russian university builds drones for Russia’s war against Ukraine.\nThe Nerdify homepage.\nThe link between essay mills and Russian attack drones might seem improbable, but understanding it begins with a simple question: How does a human-intensive academic cheating service stay relevant in an era when students can simply ask AI to write their term papers? The answer – recasting the business as an AI company – is just the latest chapter in a story of many rebrands that link the operation to Russia’s largest private university.\nSearch in Google for any terms related to academic cheating services — e.g., “help with exam online” or “term paper online” — and you’re likely to encounter websites with the words “nerd” or “geek” in them, such as\nthenerdify[.]com\nand\ngeekly-hub[.]com\n. With a simple request sent via text message, you can hire their tutors to help with any assignment.\nThese nerdy and geeky-branded websites frequently cite their “honor code,” which emphasizes they do not condone academic cheating, will not write your term papers for you, and will only offer support and advice for customers. But according to\nThis Isn’t Fine\n, a Substack blog about contract cheating and essay mills, the Nerdify brand of websites will happily ignore that mantra.\n“We tested the quick SMS for a price quote,” wrote This Isn’t Fine author\nJoseph Thibault\n. “The honor code references and platitudes apparently stop at the website. Within three minutes, we confirmed that a full three-page, plagiarism- and AI-free MLA formatted Argumentative essay could be ours for the low price of $141.”\nA screenshot from Joseph Thibault’s Substack post shows him purchasing a 3-page paper with the Nerdify service.\nGoogle prohibits ads that “enable dishonest behavior.” Yet, a sprawling global essay and homework cheating network run under the Nerdy brands has quietly bought its way to the top of Google searches – booking revenues of almost $25 million through a maze of companies in Cyprus, Malta and Hong Kong, while pitching “tutoring” that delivers finished work that students can turn in.\nWhen one Nerdy-related Google Ads account got shut down, the group behind the company would form a new entity with a front-person (typically a young Ukrainian woman), start a new ads account along with a new website and domain name (usually with “nerdy” in the brand), and resume running Google ads for the same set of keywords.\nUK companies belonging to the group that have been shut down by Google Ads since Jan 2025 include:\n–\nProglobal Solutions LTD\n(advertised nerdifyit[.]com);\n–\nAW Tech Limited\n(advertised thenerdify[.]com);\n–\nGeekly Solutions Ltd\n(advertised geekly-hub[.]com).\nCurrently active Google Ads accounts for the Nerdify brands include:\n-OK Marketing LTD\n(advertising geekly-hub[.]net⁩), formed in the name of\nOlha Karpenko\n, a young Ukrainian woman;\n–\nTwo Sigma Solutions LTD\n(advertising litero[.]ai), formed in the name of\nOlekszij (Alexey) Pokatilo\n.\nGoogle’s Ads Transparency page for current Nerdify advertiser OK Marketing LTD.\nMr. Pokatilo has been in the essay-writing business since at least 2009, operating a paper-mill enterprise called Livingston Research alongside\nAlexander Korsukov\n, who is listed as an owner. According to\na lengthy account from a former employee\n, Livingston Research mainly farmed its writing tasks out to low-cost workers from Kenya, Philippines, Pakistan, Russia and Ukraine.\nPokatilo moved from Ukraine to the United Kingdom in Sept. 2015 and co-founded a company called\nAwesome Technologies\n, which pitched itself as a way for people to outsource tasks by sending a text message to the service’s assistants.\nThe other co-founder of Awesome Technologies is 36-year-old\nFilip Perkon\n, a Swedish man living in London who touts himself as a serial entrepreneur and investor. Years before starting Awesome together, Perkon and Pokatilo co-founded a student group called\nRussian Business Week\nwhile the two were classmates at the London School of Economics. According to the Bulgarian investigative journalist\nChristo Grozev\n, Perkon’s birth certificate was issued by the Soviet Embassy in Sweden.\nAlexey Pokatilo (left) and Filip Perkon at a Facebook event for startups in San Francisco in mid-2015.\nAround the time Perkon and Pokatilo launched Awesome Technologies, Perkon was building a social media propaganda tool called the\nRussian Diplomatic Online Club\n, which Perkon said would “turbo-charge” Russian messaging online. The club’s newsletter urged subscribers\nto install in their Twitter accounts a third-party app called Tweetsquad\nthat would retweet Kremlin messaging on the social media platform.\nPerkon was praised by the Russian Embassy in London for his efforts: D\nuring the contentious Brexit vote that ultimately led to the United Kingdom leaving the European Union, the Russian embassy in London used this spam tweeting tool\nto auto-retweet the Russian ambassador’s posts from supporters’ accounts\n.\nNeither Mr. Perkon nor Mr. Pokatilo replied to requests for comment.\nA review of corporations tied to Mr. Perkon as indexed by the business research service\nNorth Data\nfinds he holds or held director positions in several U.K. subsidiaries of\nSynergy University\n, Russia’s largest private education provider. Synergy has more than 35,000 students, and sells T-shirts with patriotic slogans such as “Crimea is Ours,” and “The Russian Empire — Reloaded.”\nThe president of Synergy University is\nVadim Lobov\n, a Kremlin insider whose headquarters on the outskirts of Moscow reportedly features a wall-sized portrait of\nRussian President Vladimir Putin\nin the pop-art style of Andy Warhol. For a number of years, Lobov and Perkon co-produced a cross-cultural event in the U.K. called\nRussian Film Week\n.\nSynergy President Vadim Lobov and Filip Perkon, speaking at a press conference for Russian Film Week, a cross-cultural event in the U.K. co-produced by both men.\nMr. Lobov was one of 11 individuals\nreportedly hand-picked\nby the convicted Russian spy\nMarina Butina\nto attend the 2017 National Prayer Breakfast held in Washington D.C. just two weeks after President Trump’s first inauguration.\nWhile Synergy University promotes itself as Russia’s largest private educational institution, hundreds of international students tell a different story. Online reviews from students paint a picture of unkept promises: Prospective students from Nigeria, Kenya, Ghana, and other nations paying thousands in advance fees for promised study visas to Russia, only to have their applications denied with no refunds offered.\n“My experience with Synergy University has been nothing short of heartbreaking,” reads one such account. “When I first discovered the school, their representative was extremely responsive and eager to assist. He communicated frequently and made me believe I was in safe hands. However, after paying my hard-earned tuition fees, my visa was denied. It’s been over 9 months since that denial, and despite their promises, I have received no refund whatsoever. My messages are now ignored, and the same representative who once replied instantly no longer responds at all. Synergy University, how can an institution in Europe feel comfortable exploiting the hopes of Africans who trust you with their life savings? This is not just unethical — it’s predatory.”\nThis pattern repeats across reviews by multilingual students from Pakistan, Nepal, India, and various African nations — all describing the same scheme: Attractive online marketing, promises of easy visa approval, upfront payment requirements, and then silence after visa denials.\nReddit discussions in r/Moscow and r/AskARussian are filled with warnings. “It’s a scam, a diploma mill,” writes one user. “They literally sell exams. There was an investigation on Rossiya-1 television showing students paying to pass tests.”\nThe Nerdify website’s “About Us” page says the company was co-founded by Pokatilo and an American named\nBrian Mellor\n. The latter identity seems to have been fabricated, or at least there is no evidence that a person with this name ever worked at Nerdify.\nRather, it appears that the SMS assistance company co-founded by Messrs. Pokatilo and Perkon (Awesome Technologies) fizzled out shortly after its creation, and that Nerdify soon adopted the process of accepting assignment requests via text message and routing them to freelance writers.\nA closer look at an early “About Us” page for Nerdify in The Wayback Machine suggests that Mr. Perkon was the real co-founder of the company: The photo at the top of the page shows four people wearing Nerdify T-shirts seated around a table on a rooftop deck in San Francisco, and the man facing the camera is Perkon.\nFilip Perkon, top right, is pictured wearing a Nerdify T-shirt in an archived copy of the company’s About Us page. Image: archive.org.\nWhere are they now?\nPokatilo is currently running a startup called\nLitero.Ai\n, which appears to be an AI-based essay writing service. In July 2025, Mr. Pokatilo received pre-seed funding of $800,000 for Litero from an investment program backed by the venture capital firms AltaIR Capital, Yellow Rocks, Smart Partnership Capital, and I2BF Global Ventures.\nMeanwhile, Filip Perkon is busy setting up\ntoy rubber duck stores in Miami\nand in\nat least three locations in the United Kingdom\n. These “Duck World” shops market themselves as “the world’s largest duck store.”\nThis past week, Mr. Lobov\nwas in India with Putin’s entourage\non a charm tour with India’s Prime Minister Narendra Modi. Although Synergy is billed as an educational institution, a review of the company’s sprawling corporate footprint (via DNS) shows it also is assisting the Russian government in its war against Ukraine.\nSynergy University President Vadim Lobov (right) pictured this week in India next to Natalia Popova, a Russian TV presenter known for her close ties to Putin’s family, particularly Putin’s daughter, who works with Popova at the education and culture-focused Innopraktika Foundation.\nThe website\nbpla.s\nynergy[.]bot\n, for instance, says the company is involved in developing combat drones to aid Russian forces and to evade international sanctions on the supply and re-export of high-tech products.\nA screenshot from the website of synergy,bot shows the company is actively engaged in building armed drones for the war in Ukraine.\nKrebsOnSecurity would like to thank the anonymous researcher\nNatInfoSec\nfor their assistance in this investigation.\nUpdate, Dec. 8, 10:06 a.m. ET:\nMr. Pokatilo responded to requests for comment after the publication of this story. Pokatilo said he has no relation to Synergy nor to Mr. Lobov, and that his work with Mr. Perkon ended with the dissolution of Awesome Technologies.\n“I have had no involvement in any of his projects and business activities mentioned in the article and he has no involvement in Litero.ai,” Pokatilo said of Perkon.\nMr. Pokatilo said his new company Litero “does not provide contract cheating services and is built specifically to improve transparency and academic integrity in the age of universal use of AI by students.”\n“I am Ukrainian,” he said in an email. “My close friends, colleagues, and some family members continue to live in Ukraine under the ongoing invasion. Any suggestion that I or my company may be connected in any way to Russia’s war efforts is deeply offensive on a personal level and harmful to the reputation of Litero.ai, a company where many team members are Ukrainian.”\nUpdate, Dec. 11, 12:07 p.m. ET:\nMr. Perkon responded to requests for comment after the publication of this story. Perkon said the photo of him in a Nerdify T-shirt (see screenshot above) was taken after a startup event in San Francisco, where he volunteered to act as a photo model to help friends with their project.\n“I have no business or other relations to Nerdify or any other ventures in that space,” Mr. Perkon said in an email response. “As for Vadim Lobov, I worked for Venture Capital arm at Synergy until 2013 as well as his business school project in the UK, that didn’t get off the ground, so the company related to this was made dormant. Then Synergy kindly provided sponsorship for my Russian Film Week event that I created and ran until 2022 in the U.K., an event that became the biggest independent Russian film festival outside of Russia. Since the start of the Ukraine war in 2022 I closed the festival down.”\n“I have had no business with Vadim Lobov since 2021 (the last film festival) and I don’t keep track of his endeavours,” Perkon continued. “As for Alexey Pokatilo, we are university friends. Our business relationship has ended after the concierge service Awesome Technologies didn’t work out, many years ago.”",
    "date_extraction": "2025-12-25T09:46:49.615408"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/12/sms-phishers-pivot-to-points-taxes-fake-retailers/",
    "titre": "SMS Phishers Pivot to Points, Taxes, Fake Retailers",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "China-based phishing groups blamed for non-stop scam SMS messages about a supposed wayward package or unpaid toll fee are promoting a new offering, just in time for the holiday shopping season: Phishing kits for mass-creating fake but convincing e-commerce websites that convert customer payment card data into mobile wallets from Apple and Google. Experts say these same phishing groups also are now using SMS lures that promise unclaimed tax refunds and mobile rewards points.\nOver the past week, thousands of domain names were registered for scam websites that purport to offer\nT-Mobile\ncustomers the opportunity to claim a large number of rewards points. The phishing domains are being promoted by scam messages sent via Apple’s iMessage service or the functionally equivalent RCS messaging service built into Google phones.\nAn instant message spoofing T-Mobile says the recipient is eligible to claim thousands of rewards points.\nThe website scanning service\nurlscan.io\nshows\nthousands of these phishing domains have been deployed in just the past few days alone. The phishing websites will only load if the recipient visits with a mobile device, and they ask for the visitor’s name, address, phone number and payment card data to claim the points.\nA phishing website registered this week that spoofs T-Mobile.\nIf card data is submitted, the site will then prompt the user to share a one-time code sent via SMS by their financial institution. In reality, the bank is sending the code because the fraudsters have just attempted to enroll the victim’s phished card details in a mobile wallet from Apple or Google. If the victim also provides that one-time code, the phishers can then\nlink the victim’s card to a mobile device that they physically control\n.\nPivoting off these T-Mobile phishing domains in urlscan.io reveals a similar scam targeting\nAT&T\ncustomers:\nAn SMS phishing or “smishing” website targeting AT&T users.\nFord Merrill\nworks in security research at\nSecAlliance\n, a\nCSIS Security Group\ncompany. Merrill said multiple China-based cybercriminal groups that sell phishing-as-a-service platforms have been using the mobile points lure for some time, but the scam has only recently been pointed at consumers in the United States.\n“These points redemption schemes have not been very popular in the U.S., but have been in other geographies like EU and Asia for a while now,” Merrill said.\nA review of other domains flagged by urlscan.io as tied to this Chinese SMS phishing syndicate shows they are also spoofing U.S. state tax authorities, telling recipients they have an unclaimed tax refund. Again, the goal is to phish the user’s payment card information and one-time code.\nA text message that spoofs the District of Columbia’s Office of Tax and Revenue.\nCAVEAT EMPTOR\nMany SMS phishing or “smishing” domains are quickly flagged by browser makers as malicious. But Merrill said one burgeoning area of growth for these phishing kits — fake e-commerce shops — can be far harder to spot because they do not call attention to themselves by spamming the entire world.\nMerrill said the same Chinese phishing kits used to blast out package redelivery message scams are equipped with modules that make it simple to quickly deploy a fleet of fake but convincing e-commerce storefronts. Those phony stores are typically advertised on\nGoogle\nand\nFacebook\n, and consumers usually end up at them by searching online for deals on specific products.\nA machine-translated screenshot of an ad from a China-based phishing group promoting their fake e-commerce shop templates.\nWith these fake e-commerce stores, the customer is supplying their payment card and personal information as part of the normal check-out process, which is then punctuated by a request for a one-time code sent by your financial institution. The fake shopping site claims the code is required by the user’s bank to verify the transaction, but it is sent to the user because the scammers immediately attempt to enroll the supplied card data in a mobile wallet.\nAccording to Merrill, it is only during the check-out process that these fake shops will fetch the malicious code that gives them away as fraudulent, which tends to make it difficult to locate these stores simply by mass-scanning the web. Also, most customers who pay for products through these sites don’t realize they’ve been snookered until weeks later when the purchased item fails to arrive.\n“The fake e-commerce sites are tough because a lot of them can fly under the radar,” Merrill said. “They can go months without being shut down, they’re hard to discover, and they generally don’t get flagged by safe browsing tools.”\nHappily, reporting these SMS phishing lures and websites is one of the fastest ways to get them properly identified and shut down.\nRaymond Dijkxhoorn\nis the CEO and a founding member of\nSURBL\n, a widely-used blocklist that flags domains and IP addresses known to be used in unsolicited messages, phishing and malware distribution. SURBL has created a website called\nsmishreport.com\nthat asks users to forward a screenshot of any smishing message(s) received.\n“If [a domain is] unlisted, we can find and add the new pattern and kill the rest” of the matching domains,\nDijkxhoorn\nsaid. “Just make a screenshot and upload. The tool does the rest.”\nThe SMS phishing reporting site smishreport.com.\nMerrill said the last few weeks of the calendar year typically see a big uptick in smishing — particularly package redelivery schemes that spoof the\nU.S. Postal Service\nor commercial shipping companies.\n“Every holiday season there is an explosion in smishing activity,” he said. “Everyone is in a bigger hurry, frantically shopping online, paying less attention than they should, and they’re just in a better mindset to get phished.”\nSHOP ONLINE LIKE A SECURITY PRO\nAs we can see, adopting a shopping strategy of simply buying from the online merchant with the lowest advertised prices can be a bit like playing Russian Roulette with your wallet. Even people who shop mainly at big-name online stores\ncan get scammed\nif they’re not wary of too-good-to-be-true offers (think third-party sellers on these platforms).\nIf you don’t know much about the online merchant that has the item you wish to buy, take a few minutes to investigate its reputation. If you’re buying from an online store that is brand new, the risk that you will get scammed increases significantly. How do you know the lifespan of a site selling that must-have gadget at the lowest price? One easy way to get a quick idea is to run\na basic WHOIS search\non the site’s domain name. The more recent the site’s “created” date, the more likely it is a phantom store.\nIf you receive a message warning about a problem with an order or shipment, visit the e-commerce or shipping site directly, and avoid clicking on links or attachments — particularly missives that warn of some dire consequences unless you act quickly. Phishers and malware purveyors typically seize upon some kind of emergency to create a false alarm that often causes recipients to temporarily let their guard down.\nBut it’s not just outright scammers who can trip up your holiday shopping: Often times, items that are advertised at steeper discounts than other online stores make up for it by charging way more than normal for shipping and handling.\nSo be careful what you agree to: Check to make sure you know how long the item will take to be shipped, and that you understand the store’s return policies. Also, keep an eye out for hidden surcharges, and be wary of blithely clicking “ok” during the checkout process.\nMost importantly, keep a close eye on your monthly statements. If I were a fraudster, I’d most definitely wait until the holidays to cram through a bunch of unauthorized charges on stolen cards, so that the bogus purchases would get buried amid a flurry of other legitimate transactions. That’s why it’s key to closely review your credit card bill and to quickly dispute any charges you didn’t authorize.",
    "date_extraction": "2025-12-25T09:46:50.698711"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/11/meet-rey-the-admin-of-scattered-lapsus-hunters/",
    "titre": "Meet Rey, the Admin of ‘Scattered Lapsus$ Hunters’",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "A prolific cybercriminal group that calls itself “\nScattered LAPSUS$ Hunters\n” has dominated headlines this year by regularly stealing data from and publicly mass extorting dozens of major corporations. But the tables seem to have turned somewhat for “Rey,” the moniker chosen by the technical operator and public face of the hacker group: Earlier this week, Rey confirmed his real life identity and agreed to an interview after KrebsOnSecurity tracked him down and contacted his father.\nScattered LAPSUS$ Hunters (SLSH) is thought to be an amalgamation of three hacking groups —\nScattered Spider\n,\nLAPSUS$\nand\nShinyHunters\n. Members of these gangs hail from many of the same chat channels on the\nCom\n, a mostly English-language cybercriminal community that operates across an ocean of Telegram and Discord servers.\nIn May 2025, SLSH members launched\na social engineering campaign\nthat used voice phishing to trick targets into connecting a malicious app to their organization’s Salesforce portal. The group later launched a data leak portal that threatened to publish the internal data of three dozen companies that allegedly had Salesforce data stolen, including\nToyota\n,\nFedEx\n,\nDisney/Hulu\n, and\nUPS\n.\nThe new extortion website tied to ShinyHunters, which threatens to publish stolen data unless Salesforce or individual victim companies agree to pay a ransom.\nLast week, the SLSH Telegram channel featured an offer to recruit and reward “insiders,” employees at large companies who agree to share internal access to their employer’s network for a share of whatever ransom payment is ultimately paid by the victim company.\nSLSH has solicited insider access previously, but their latest call for disgruntled employees started making the rounds on social media at the same time news broke that the cybersecurity firm\nCrowdstrike\nhad fired an employee for\nallegedly sharing screenshots of internal systems\nwith the hacker group (Crowdstrike said their systems were never compromised and that it has turned the matter over to law enforcement agencies).\nThe Telegram server for the Scattered LAPSUS$ Hunters has been attempting to recruit insiders at large companies.\nMembers of SLSH have traditionally used other ransomware gangs’ encryptors in attacks, including malware from ransomware affiliate programs like ALPHV/BlackCat, Qilin, RansomHub, and DragonForce. But last week, SLSH announced on its Telegram channel\nthe release of their own ransomware-as-a-service operation\ncalled\nShinySp1d3r\n.\nThe individual responsible for releasing the ShinySp1d3r ransomware offering is a core SLSH member who goes by the handle “Rey” and who is currently one of just three administrators of the SLSH Telegram channel. Previously, Rey was an\nadministrator\nof the data leak website for\nHellcat\n, a ransomware group that surfaced in late 2024 and was involved in attacks on companies including\nSchneider Electric\n,\nTelefonica\n, and\nOrange Romania\n.\nA recent, slightly redacted screenshot of the Scattered LAPSUS$ Hunters Telegram channel description, showing Rey as one of three administrators.\nAlso in 2024, Rey would take over as administrator of the\nmost recent incarnation of BreachForums\n, an English-language cybercrime forum whose domain names have been seized on multiple occasions by the FBI and/or by international authorities. In April 2025, Rey\nposted on Twitter/X\nabout another FBI seizure of BreachForums.\nOn October 5, 2025, the FBI\nannounced\nit had once again seized the domains associated with BreachForums, which it described as a major criminal marketplace used by ShinyHunters and others to traffic in stolen data and facilitate extortion.\n“This takedown removes access to a key hub used by these actors to monetize intrusions, recruit collaborators, and target victims across multiple sectors,” the FBI said.\nIncredibly, Rey would make a series of critical operational security mistakes last year that provided multiple avenues to ascertain and confirm his real-life identity and location. Read on to learn how it all unraveled for Rey.\nWHO IS REY?\nAccording to the cyber intelligence firm\nIntel 471\n, Rey was an active user on various\nBreachForums\nreincarnations over the past two years, authoring more than 200 posts between February 2024 and July 2025. Intel 471 says Rey previously used the handle “\nHikki-Chan\n” on BreachForums, where their first post shared data allegedly stolen from the\nU.S. Centers for Disease Control and Prevention\n(CDC).\nIn that February 2024 post about the CDC, Hikki-Chan says they could be reached at the Telegram username\n@wristmug\n. In May 2024, @wristmug posted in a Telegram group chat called “Pantifan” a copy of an extortion email they said they received that included their email address and password.\nThe message that @wristmug cut and pasted appears to have been part of an\nautomated email scam\nthat claims it was sent by a hacker who has compromised your computer and used your webcam to record a video of you while you were watching porn. These missives threaten to release the video to all your contacts unless you pay a Bitcoin ransom, and they typically reference a real password the recipient has used previously.\n“Noooooo,” the @wristmug account wrote in mock horror after posting a screenshot of the scam message. “I must be done guys.”\nA message posted to Telegram by Rey/@wristmug.\nIn posting their screenshot, @wristmug redacted the username portion of the email address referenced in the body of the scam message. However, they did not redact their previously-used password, and they left the domain portion of their email address (@proton.me) visible in the screenshot.\nO5TDEV\nSearching on @wristmug’s rather unique 15-character password in the breach tracking service\nSpycloud\nfinds it is known to have been used by just one email address:\ncybero5tdev@proton.me\n. According to Spycloud, those credentials were exposed at least twice in early 2024 when this user’s device was infected with an infostealer trojan that siphoned all of its stored usernames, passwords and authentication cookies (a finding that was\ninitially revealed\nin March 2025 by the cyber intelligence firm\nKELA\n).\nIntel 471 shows the email address cybero5tdev@proton.me belonged to a BreachForums member who went by the username\no5tdev\n. Searching on this nickname in Google brings up at least two website defacement archives showing that a user named o5tdev was previously involved in\ndefacing sites with pro-Palestinian messages\n. The screenshot below, for example, shows that 05tdev was part of a group called\nCyb3r Drag0nz Team\n.\nRey/o5tdev’s defacement pages. Image: archive.org.\nA 2023 report from\nSentinelOne\ndescribed Cyb3r Drag0nz Team as a hacktivist group with a history of launching DDoS attacks and cyber defacements as well as engaging in data leak activity.\n“Cyb3r Drag0nz Team claims to have leaked data on over a million of Israeli citizens spread across multiple leaks,” SentinelOne\nreported\n. “To date, the group has released multiple .RAR archives of purported personal information on citizens across Israel.”\nThe cyber intelligence firm\nFlashpoint\nfinds the Telegram user @05tdev was active in 2023 and early 2024, posting in Arabic on anti-Israel channels like “Ghost of Palestine” [full disclosure: Flashpoint is currently an advertiser on this blog].\n‘I’M A GINTY’\nFlashpoint shows that Rey’s Telegram account (ID7047194296) was particularly active in a cybercrime-focused channel called\nJacuzzi\n, where this user shared several personal details, including that their father was an airline pilot. Rey claimed in 2024 to be 15 years old, and to have family connections to Ireland.\nSpecifically, Rey mentioned in several Telegram chats that he had Irish heritage, even posting a graphic that shows the prevalence of the surname “\nGinty\n.”\nRey, on Telegram claiming to have association to the surname “Ginty.” Image: Flashpoint.\nSpycloud indexed hundreds of credentials stolen from cybero5dev@proton.me, and those details indicate that Rey’s computer is a shared Microsoft Windows device located in Amman, Jordan. The credential data stolen from Rey in early 2024 show there are multiple users of the infected PC, but that all shared the same last name of Khader and an address in Amman, Jordan.\nThe “autofill” data lifted from Rey’s family PC contains an entry for a 46-year-old\nZaid Khader\nthat says his mother’s maiden name was Ginty. The infostealer data also shows Zaid Khader frequently accessed internal websites for employees of\nRoyal Jordanian Airlines\n.\nMEET SAIF\nThe infostealer data makes clear that Rey’s full name is\nSaif Al-Din Khader\n. Having no luck contacting Saif directly, KrebsOnSecurity sent an email to his father Zaid. The message invited the father to respond via email, phone or Signal, explaining that his son appeared to be deeply enmeshed in a serious cybercrime conspiracy.\nLess than two hours later, I received a Signal message from Saif, who said his dad suspected the email was a scam and had forwarded it to him.\n“I saw your email, unfortunately I don’t think my dad would respond to this because they think its some ‘scam email,'” said Saif, who told me he turns 16 years old next month. “So I decided to talk to you directly.”\nSaif explained that he’d already heard from European law enforcement officials, and had been trying to extricate himself from SLSH. When asked why then he was involved in releasing SLSH’s new ShinySp1d3r ransomware-as-a-service offering, Saif said he couldn’t just suddenly quit the group.\n“Well I cant just dip like that, I’m trying to clean up everything I’m associated with and move on,” he said.\nThe former Hellcat ransomware site. Image: Kelacyber.com\nHe also shared that ShinySp1d3r is just a rehash of Hellcat ransomware, except modified with AI tools. “I gave the source code of Hellcat ransomware out basically.”\nSaif claims he reached out on his own recently to the Telegram account for\nOperation Endgame,\nthe codename for an ongoing law enforcement operation\ntargeting cybercrime services, vendors and their customers\n.\n“I’m already cooperating with law enforcement,” Saif said. “In fact, I have been talking to them since at least June. I have told them nearly everything. I haven’t really done anything like breaching into a corp or extortion related since September.”\nSaif suggested that a story about him right now could endanger any further cooperation he may be able to provide. He also said he wasn’t sure if the U.S. or European authorities had been in contact with the Jordanian government about his involvement with the hacking group.\n“A story would bring so much unwanted heat and would make things very difficult if I’m going to cooperate,” Saif said. “I’m unsure whats going to happen they said they’re in contact with multiple countries regarding my request but its been like an entire week and I got no updates from them.”\nSaif shared a screenshot that indicated he’d contacted Europol authorities late last month. But he couldn’t name any law enforcement officials he said were responding to his inquiries, and KrebsOnSecurity was unable to verify his claims.\n“I don’t really care I just want to move on from all this stuff even if its going to be prison time or whatever they gonna say,” Saif said.",
    "date_extraction": "2025-12-25T09:46:51.794794"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/11/is-your-android-tv-streaming-box-part-of-a-botnet/",
    "titre": "Is Your Android TV Streaming Box Part of a Botnet?",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "On the surface, the\nSuperbox\nmedia streaming devices for sale at retailers like\nBestBuy\nand\nWalmart\nmay seem like a steal: They offer unlimited access to more than 2,200 pay-per-view and streaming services like\nNetflix\n,\nESPN\nand\nHulu\n, all for a one-time fee of around $400. But security experts warn these TV boxes require intrusive software that forces the user’s network to relay Internet traffic for others, traffic that is often tied to cybercrime activity such as advertising fraud and account takeovers.\nSuperbox media streaming boxes for sale on Walmart.com.\nSuperbox bills itself as an affordable way for households to stream all of the television and movie content they could possibly want, without the hassle of monthly subscription fees — for a one-time payment of nearly $400.\n“Tired of confusing cable bills and hidden fees?,” Superbox’s website asks in a recent blog post titled, “Cheap Cable TV for Low Income: Watch TV, No Monthly Bills.”\n“Real cheap cable TV for low income solutions does exist,” the blog continues. “This guide breaks down the best alternatives to stop overpaying, from free over-the-air options to one-time purchase devices that eliminate monthly bills.”\nSuperbox claims that watching a stream of movies, TV shows, and sporting events won’t violate U.S. copyright law.\n“SuperBox is just like any other Android TV box on the market, we can not control what software customers will use,” the company’s website maintains. “And you won’t encounter a law issue unless uploading, downloading, or broadcasting content to a large group.”\nA blog post from the Superbox website.\nThere is nothing illegal about the sale or use of the Superbox itself, which can be used strictly as a way to stream content at providers where users already have a paid subscription. But that is not why people are shelling out $400 for these machines. The only way to watch those 2,200+ channels for free with a Superbox is to install several apps made for the device that enable them to stream this content.\nSuperbox’s homepage includes a prominent message stating the company does “not sell access to or preinstall any apps that bypass paywalls or provide access to unauthorized content.” The company explains that they merely provide the hardware, while customers choose which apps to install.\n“We only sell the hardware device,” the notice states. “Customers must use official apps and licensed services; unauthorized use may violate copyright law.”\nSuperbox is technically correct here, except for maybe the part about how customers must use official apps and licensed services: Before the Superbox can stream those thousands of channels, users must configure the device to update itself, and the first step involves ripping out Google’s official Play store and replacing it with something called the “App Store” or “Blue TV Store.”\nSuperbox does this because the device does not use the official Google-certified Android TV system, and its apps will not load otherwise. Only after the Google Play store has been supplanted by this unofficial App Store do the various movie and video streaming apps that are built specifically for the Superbox appear available for download (again, outside of Google’s app ecosystem).\nExperts say while these Android streaming boxes generally do what they advertise — enabling buyers to stream video content that would normally require a paid subscription — the apps that enable the streaming also ensnare the user’s Internet connection in a distributed residential proxy network that uses the devices to relay traffic from others.\nAshley\nis a senior solutions engineer at\nCensys\n, a cyber intelligence company that indexes Internet-connected devices, services and hosts. Ashley requested that only her first name be used in this story.\nIn a recent video interview, Ashley showed off several Superbox models that Censys was studying in the malware lab — including one purchased off the shelf at BestBuy.\n“I’m sure a lot of people are thinking, ‘Hey, how bad could it be if it’s for sale at the big box stores?'” she said. “But the more I looked, things got weirder and weirder.”\nAshley said she found the Superbox devices immediately contacted a server at the Chinese instant messaging service\nTencent\nQQ\n, as well as a residential proxy service called\nGrass IO\n.\nGET GRASSED\nAlso known as getgrass[.]io, Grass says it is “a decentralized network that allows users to earn rewards by sharing their unused Internet bandwidth with AI labs and other companies.”\n“Buyers seek unused internet bandwidth to access a more diverse range of IP addresses, which enables them to see certain websites from a retail perspective,” the Grass website explains. “By utilizing your unused internet bandwidth, they can conduct market research, or perform tasks like web scraping to train AI.”\nReached via Twitter/X, Grass founder\nAndrej Radonjic\ntold KrebsOnSecurity he’d never heard of a Superbox, and that Grass has no affiliation with the device maker.\n“It looks like these boxes are distributing an unethical proxy network which people are using to try to take advantage of Grass,” Radonjic said. “The point of grass is to be an opt-in network. You download the grass app to monetize your unused bandwidth. There are tons of sketchy SDKs out there that hijack people’s bandwidth to help webscraping companies.”\nRadonjic said Grass has implemented “a robust system to identify network abusers,” and that if it discovers anyone trying to misuse or circumvent its terms of service, the company takes steps to stop it and prevent those users from earning points or rewards.\nSuperbox’s parent company,\nSuper Media Technology Company Ltd.\n, lists its street address as a UPS store in Fountain Valley, Calif. The company did not respond to multiple inquiries.\nAccording to\nthis teardown by behindmlm.com\n, a blog that covers multi-level marketing (MLM) schemes, Grass’s compensation plan is built around “grass points,” which are earned through the use of the Grass app and through app usage by recruited affiliates. Affiliates can earn 5,000 grass points for clocking 100 hours usage of Grass’s app, but they must progress through ten affiliate tiers or ranks before they can redeem their grass points (presumably for some type of cryptocurrency). The 10th or “Titan” tier requires affiliates\nto accumulate a whopping 50 million grass points, or recruit at least 221 more affiliates\n.\nRadonjic said Grass’s system has changed in recent months, and confirmed the company has a referral program where users can earn Grass Uptime Points by contributing their own bandwidth and/or by inviting other users to participate.\n“Users are not required to participate in the referral program to earn Grass Uptime Points or to receive Grass Tokens,” Radonjic said. “Grass is in the process of phasing out the referral program and has introduced an updated Grass Points model.”\nA review of the Terms and Conditions page for getgrass[.]io at the Wayback Machine shows Grass’s parent company has changed names at least five times in the course of its two-year existence. Searching the Wayback Machine on getgrass[.]io shows that in June 2023 Grass was owned by a company called\nWynd Network\n. By March 2024, the owner was listed as\nLower Tribeca Corp.\nin the Bahamas. By August 2024, Grass was controlled by a\nHalf Space Labs Limited\n, and in November 2024 the company was owned by\nGrass OpCo (BVI) Ltd\n. Currently, the Grass website says its parent is just\nGrass OpCo Ltd\n(no BVI in the name).\nRadonjic acknowledged that Grass has undergone “a handful of corporate clean-ups over the last couple of years,” but described them as administrative changes that had no operational impact. “These reflect normal early-stage restructuring as the project moved from initial development…into the current structure under the Grass Foundation,” he said.\nUNBOXING\nCensys’s Ashley said the phone home to China’s Tencent QQ instant messaging service was the first red flag with the Superbox devices she examined. She also discovered the streaming boxes included powerful network analysis and remote access tools, such as\nTcpdump\nand\nNetcat\n.\n“This thing DNS hijacked my router, did\nARP poisoning\nto the point where things fall off the network so they can assume that IP, and attempted to bypass controls,” she said. “I have root on all of them now, and they actually have a folder called ‘secondstage.’ These devices also have Netcat and Tcpdump on them, and yet they are supposed to be streaming devices.”\nA quick online search shows various Superbox models and many similar Android streaming devices for sale at a wide range of top retail destinations, including\nAmazon\n,\nBestBuy\n,\nNewegg\n, and\nWalmart\n. Newegg.com, for example, currently lists more than three dozen Superbox models. In all cases, the products are sold by third-party merchants on these platforms, but in many instances the fulfillment comes from the e-commerce platform itself.\n“Newegg is pretty bad now with these devices,” Ashley said. “Ebay is the funniest, because they have Superbox in Spanish — the SuperCaja — which is very popular.”\nSuperbox devices for sale via Newegg.com.\nAshley said Amazon recently cracked down on Android streaming devices branded as Superbox, but that those listings can still be found under the more generic title “\nmodem and router combo\n” (which may be slightly closer to the truth about the device’s behavior).\nSuperbox doesn’t advertise its products in the conventional sense. Rather, it seems to rely on lesser-known influencers on places like Youtube and TikTok to promote the devices. Meanwhile, Ashley said, Superbox pays those influencers 50 percent of the value of each device they sell.\n“It’s weird to me because influencer marketing usually caps compensation at 15 percent, and it means they don’t care about the money,” she said. “This is about building their network.”\nA TikTok influencer casually mentions and promotes Superbox while chatting with her followers over a glass of wine.\nBADBOX\nAs plentiful as the Superbox is on e-commerce sites, it is just one brand in an ocean of no-name Android-based TV boxes available to consumers. While these devices generally do provide buyers with “free” streaming content, they also tend to include factory-installed malware or require the installation of third-party apps that engage the user’s Internet address in advertising fraud.\nIn July 2025, Google filed a “John Doe”\nlawsuit\n(PDF) against 25 unidentified defendants dubbed the “\nBadBox 2.0 Enterprise\n,” which Google described as a botnet of over ten million Android streaming devices that engaged in advertising fraud. Google said the BADBOX 2.0 botnet, in addition to compromising multiple types of devices prior to purchase, can also infect devices by requiring the download of malicious apps from unofficial marketplaces.\nSome of the unofficial Android devices flagged by Google as part of the Badbox 2.0 botnet are still widely for sale at major e-commerce vendors. Image: Google.\nSeveral of the Android streaming devices flagged in Google’s lawsuit are still for sale on top U.S. retail sites. For example, searching for the “\nX88Pro 10\n” and the “\nT95\n” Android streaming boxes finds both continue to be peddled by Amazon sellers.\nGoogle’s lawsuit came on the heels of a\nJune 2025 advisory\nfrom the\nFederal Bureau of Investigation\n(FBI), which warned that cyber criminals were gaining unauthorized access to home networks by either configuring the products with malicious software prior to the user’s purchase, or infecting the device as it downloads required applications that contain backdoors, usually during the set-up process.\n“Once these compromised IoT devices are connected to home networks, the infected devices are susceptible to becoming part of the BADBOX 2.0 botnet and residential proxy services known to be used for malicious activity,” the FBI said.\nThe FBI said BADBOX 2.0 was discovered after the original BADBOX campaign was disrupted in 2024. The original BADBOX was identified in 2023, and primarily consisted of Android operating system devices that were compromised with backdoor malware prior to purchase.\nRiley Kilmer\nis founder of\nSpur\n, a company that tracks residential proxy networks. Kilmer said Badbox 2.0 was used as a distribution platform for\nIPidea\n, a China-based entity that is now the world’s largest residential proxy network.\nKilmer and others say IPidea is merely a rebrand of\n911S5 Proxy\n, a China-based proxy provider\nsanctioned last year\nby the\nU.S. Department of the Treasury\nfor operating a botnet that helped criminals steal billions of dollars from financial institutions, credit card issuers, and federal lending programs (the\nU.S. Department of Justice\nalso arrested the alleged owner of 911S5).\nHow are most IPidea customers using the proxy service? According to the proxy detection service\nSynthient\n, six of the top ten destinations for IPidea proxies involved traffic that has been linked to either ad fraud or credential stuffing (account takeover attempts).\nKilmer said companies like Grass are probably being truthful when they say that some of their customers are\ncompanies performing web scraping to train artificial intelligence efforts\n, because a great deal of content scraping which ultimately benefits AI companies is now leveraging these proxy networks to further obfuscate their aggressive data-slurping activity. By routing this unwelcome traffic through residential IP addresses, Kilmer said, content scraping firms can make it far trickier to filter out.\n“Web crawling and scraping has always been a thing, but AI made it like a commodity, data that had to be collected,” Kilmer told KrebsOnSecurity. “Everybody wanted to monetize their own data pots, and how they monetize that is different across the board.”\nSOME FRIENDLY ADVICE\nProducts like Superbox are drawing increased interest from consumers as more popular network television shows and sportscasts migrate to subscription streaming services, and as people begin to realize they’re spending as much or more on streaming services than they previously paid for cable or satellite TV.\nThese streaming devices from no-name technology vendors are another example of the maxim, “If something is free, you are the product,” meaning the company is making money by selling access to and/or information about its users and their data.\nSuperbox owners might counter, “Free? I paid $400 for that device!” But remember: Just because you paid a lot for something doesn’t mean you are done paying for it, or that somehow you are the only one who might be worse off from the transaction.\nIt may be that many Superbox customers don’t care if someone uses their Internet connection to tunnel traffic for ad fraud and account takeovers; for them, it beats paying for multiple streaming services each month. My guess, however, is that quite a few people who buy (or are gifted) these products have little understanding of the bargain they’re making when they plug them into an Internet router.\nSuperbox performs some serious linguistic gymnastics to claim its products don’t violate copyright laws, and that its customers alone are responsible for understanding and observing any local laws on the matter. However, buyer beware: If you’re a resident of the United States, you should know that using these devices for unauthorized streaming violates the\nDigital Millennium Copyright Act\n(DMCA), and can incur legal action, fines, and potential warnings and/or suspension of service by your Internet service provider.\nAccording to the FBI, there are several signs to look for that may indicate a streaming device you own is malicious, including:\n-The presence of suspicious marketplaces where apps are downloaded.\n-Requiring Google Play Protect settings to be disabled.\n-Generic TV streaming devices advertised as unlocked or capable of accessing free content.\n-IoT devices advertised from unrecognizable brands.\n-Android devices that are not Play Protect certified.\n-Unexplained or suspicious Internet traffic.\nThis explainer\nfrom the\nElectronic Frontier Foundation\ndelves a bit deeper into each of the potential symptoms listed above.",
    "date_extraction": "2025-12-25T09:46:52.920998"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/11/mozilla-says-its-finally-done-with-two-faced-onerep/",
    "titre": "Mozilla Says It’s Finally Done With Two-Faced Onerep",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "In March 2024,\nMozilla\nsaid it was winding down its collaboration with\nOnerep\n— an identity protection service offered with the\nFirefox\nweb browser that promises to remove users from hundreds of people-search sites — after KrebsOnSecurity revealed Onerep’s founder had created dozens of people-search services and was continuing to operate at least one of them. Sixteen months later, however, Mozilla is still promoting Onerep. This week, Mozilla announced its partnership with Onerep will officially end next month.\nMozilla Monitor. Image Mozilla Monitor Plus video on Youtube.\nIn\na statement\npublished Tuesday, Mozilla said it will soon discontinue\nMonitor Plus\n, which offered data broker site scans and automated personal data removal from Onerep.\n“We will continue to offer our free Monitor data breach service, which is integrated into Firefox’s credential manager, and we are focused on integrating more of our privacy and security experiences in Firefox, including our VPN, for free,” the advisory reads.\nMozilla said current Monitor Plus subscribers will retain full access through the wind-down period, which ends on Dec. 17, 2025. After that, those subscribers will automatically receive a prorated refund for the unused portion of their subscription.\n“We explored several options to keep Monitor Plus going, but our high standards for vendors, and the realities of the data broker ecosystem made it challenging to consistently deliver the level of value and reliability we expect for our users,” Mozilla statement reads.\nOn March 14, 2024, KrebsOnSecurity published an investigation showing that Onerep’s Belarusian CEO and founder\nDimitiri Shelest\nlaunched dozens of people-search services since 2010\n, including a still-active data broker called Nuwber that sells background reports on people. Shelest released\na lengthy statement\nwherein he acknowledged maintaining an ownership stake in\nNuwber\n, a data broker he founded in 2015 — around the same time he launched Onerep.",
    "date_extraction": "2025-12-25T09:46:53.987761"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/11/the-cloudflare-outage-may-be-a-security-roadmap/",
    "titre": "The Cloudflare Outage May Be a Security Roadmap",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "An intermittent outage at\nCloudflare\non Tuesday briefly knocked many of the Internet’s top destinations offline. Some affected Cloudflare customers were able to pivot away from the platform temporarily so that visitors could still access their websites. But security experts say doing so may have also triggered an impromptu network penetration test for organizations that have come to rely on Cloudflare to block many types of abusive and malicious traffic.\nAt around 6:30 EST/11:30 UTC on Nov. 18, Cloudflare’s status page acknowledged the company was experiencing “an internal service degradation.” After several hours of Cloudflare services coming back up and failing again, many websites behind Cloudflare found they could not migrate away from using the company’s services because the Cloudflare portal was unreachable and/or because they also were getting their domain name system (DNS) services from Cloudflare.\nHowever, some customers did manage to pivot their domains away from Cloudflare during the outage. And many of those organizations probably need to take a closer look at their web application firewall (WAF) logs during that time, said\nAaron Turner\n, a faculty member at\nIANS Research\n.\nTurner said Cloudflare’s WAF does a good job filtering out malicious traffic that matches any one of\nthe top ten types of application-layer attacks\n, including credential stuffing, cross-site scripting, SQL injection, bot attacks and API abuse. But he said this outage might be a good opportunity for Cloudflare customers to better understand how their own app and website defenses may be failing without Cloudflare’s help.\n“Your developers could have been lazy in the past for SQL injection because Cloudflare stopped that stuff at the edge,” Turner said. “Maybe you didn’t have the best security QA [quality assurance] for certain things because Cloudflare was the control layer to compensate for that.”\nTurner said one company he’s working with saw a huge increase in log volume and they are still trying to figure out what was “legit malicious” versus just noise.\n“It looks like there was about an eight hour window when several high-profile sites decided to bypass Cloudflare for the sake of availability,” Turner said. “Many companies have essentially relied on Cloudflare for the\nOWASP Top Ten\n[web application vulnerabilities] and a whole range of bot blocking. How much badness could have happened in that window? Any organization that made that decision needs to look closely at any exposed infrastructure to see if they have someone persisting after they’ve switched back to Cloudflare protections.”\nTurner said some cybercrime groups likely noticed when an online merchant they normally stalk stopped using Cloudflare’s services during the outage.\n“Let’s say you were an attacker, trying to grind your way into a target, but you felt that Cloudflare was in the way in the past,” he said. “Then you see through DNS changes that the target has eliminated Cloudflare from their web stack due to the outage. You’re now going to launch a whole bunch of new attacks because the protective layer is no longer in place.”\nNicole Scott\n, senior product marketing manager at the McLean, Va. based\nReplica Cyber\n, called yesterday’s outage “a free tabletop exercise, whether you meant to run one or not.”\n“That few-hour window was a live stress test of how your organization routes around its own control plane and shadow IT blossoms under the sunlamp of time pressure,” Scott said in\na post\non LinkedIn. “Yes, look at the traffic that hit you while protections were weakened. But also look hard at the behavior inside your org.”\nScott said organizations seeking security insights from the Cloudflare outage should ask themselves:\n1. What was turned off or bypassed (WAF, bot protections, geo blocks), and for how long?\n2. What emergency DNS or routing changes were made, and who approved them?\n3. Did people shift work to personal devices, home Wi-Fi, or unsanctioned Software-as-a-Service providers to get around the outage?\n4. Did anyone stand up new services, tunnels, or vendor accounts “just for now”?\n5. Is there a plan to unwind those changes, or are they now permanent workarounds?\n6. For the next incident, what’s the intentional fallback plan, instead of decentralized improvisation?\nIn\na postmortem\npublished Tuesday evening, Cloudflare said the disruption was not caused, directly or indirectly, by a cyberattack or malicious activity of any kind.\n“Instead, it was triggered by a change to one of our database systems’ permissions which caused the database to output multiple entries into a ‘feature file’ used by our Bot Management system,” Cloudflare CEO\nMatthew Prince\nwrote. “That feature file, in turn, doubled in size. The larger-than-expected feature file was then propagated to all the machines that make up our network.”\nCloudflare estimates that roughly 20 percent of websites use its services, and with much of the modern web relying heavily on a handful of other cloud providers including\nAWS\nand\nAzure\n, even a brief outage at one of these platforms can create a single point of failure for many organizations.\nMartin Greenfield\n, CEO at the IT consultancy\nQuod Orbis\n, said Tuesday’s outage was another reminder that many organizations may be putting too many of their eggs in one basket.\n“There are several practical and overdue fixes,” Greenfield advised. “Split your estate. Spread WAF and DDoS protection across multiple zones. Use multi-vendor DNS. Segment applications so a single provider outage doesn’t cascade. And continuously monitor controls to detect single-vendor dependency.”",
    "date_extraction": "2025-12-25T09:46:55.066575"
  },
  {
    "source": "Krebs on Security",
    "url": "https://krebsonsecurity.com/2025/11/microsoft-patch-tuesday-november-2025-edition/",
    "titre": "Microsoft Patch Tuesday, November 2025 Edition",
    "date": "",
    "auteur": "Brian Krebs",
    "contenu": "Microsoft\nthis week pushed security updates to fix more than 60 vulnerabilities in its\nWindows\noperating systems and supported software, including at least one zero-day bug that is already being exploited. Microsoft also fixed a glitch that prevented some\nWindows 10\nusers from taking advantage of an extra year of security updates, which is nice because the zero-day flaw and other critical weaknesses affect all versions of Windows, including Windows 10.\nAffected products this month include the Windows OS,\nOffice\n,\nSharePoint\n,\nSQL Server\n,\nVisual Studio\n,\nGitHub Copilot\n, and\nAzure Monitor Agent\n. The zero-day threat concerns a memory corruption bug deep in the Windows innards called\nCVE-2025-62215\n. Despite the flaw’s zero-day status, Microsoft has assigned it an “important” rating rather than critical, because exploiting it requires an attacker to already have access to the target’s device.\n“These types of vulnerabilities are often exploited as part of a more complex attack chain,” said\nJohannes Ullrich\n, dean of research for the\nSANS Technology Institute\n. “However, exploiting this specific vulnerability is likely to be relatively straightforward, given the existence of prior similar vulnerabilities.”\nBen McCarthy\n, lead cybersecurity engineer at\nImmersive\n, called attention to\nCVE-2025-60274\n, a critical weakness in a core Windows graphic component (GDI+) that is used by a massive number of applications, including Microsoft Office, web servers processing images, and countless third-party applications.\n“The patch for this should be an organization’s highest priority,” McCarthy said. “While Microsoft assesses this as ‘Exploitation Less Likely,’ a 9.8-rated flaw in a ubiquitous library like GDI+ is a critical risk.”\nMicrosoft patched a critical bug in\nOffice\n—\nCVE-2025-62199\n— that can lead to remote code execution on a Windows system.\nAlex Vovk\n, CEO and co-founder of\nAction1\n, said this Office flaw is a high priority because it is low complexity, needs no privileges, and can be exploited just by viewing a booby-trapped message in the Preview Pane.\nMany of the more concerning bugs addressed by Microsoft this month affect Windows 10, an operating system that Microsoft officially ceased supporting with patches last month. As that deadline rolled around, however, Microsoft began offering Windows 10 users an extra year of free updates, so long as they register their PC to an active Microsoft account.\nJudging from the comments on\nlast month’s Patch Tuesday post\n, that registration worked for a lot of Windows 10 users, but some readers reported the option for an extra year of updates was never offered.\nNick Carroll\n, cyber incident response manager at\nNightwing\n, notes that Microsoft has recently released an out-of-band update to address\nissues when trying to enroll\nin the Windows 10 Consumer Extended Security Update program.\n“If you plan to participate in the program, make sure you update and install\nKB5071959\nto address the enrollment issues,” Carroll said. “After that is installed, users should be able to install other updates such as today’s KB5068781 which is the latest update to Windows 10.”\nChris Goettl\nat\nIvanti\nnotes that in addition to Microsoft updates today, third-party updates from\nAdobe\nand\nMozilla\nhave already been released. Also, an update for\nGoogle Chrome\nis expected soon, which means\nEdge\nwill also be in need of its own update.\nThe\nSANS Internet Storm Center\nhas a\nclickable breakdown\nof each individual fix from Microsoft, indexed by severity and CVSS score. Enterprise Windows admins involved in testing patches before rolling them out should keep an eye on\naskwoody.com\n, which often has the skinny on any updates gone awry.\nAs always, please don’t neglect to back up your data (if not your entire system) at regular intervals, and feel free to sound off in the comments if you experience problems installing any of these fixes.\n[Author’s note: This post was intended to appear on the homepage on Tuesday, Nov. 11. I’m still not sure how it happened, but somehow this story failed to publish that day. My apologies for the oversight.]",
    "date_extraction": "2025-12-25T09:46:56.144875"
  }
]